/* automatically generated by rust-bindgen */

pub const _ASSERT_H: ::std::os::raw::c_uint = 1;
pub const _FEATURES_H: ::std::os::raw::c_uint = 1;
pub const _DEFAULT_SOURCE: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC11: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC99: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC95: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX_IMPLICITLY: ::std::os::raw::c_uint = 1;
pub const _POSIX_SOURCE: ::std::os::raw::c_uint = 1;
pub const _POSIX_C_SOURCE: ::std::os::raw::c_uint = 200809;
pub const __USE_POSIX: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX2: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX199309: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX199506: ::std::os::raw::c_uint = 1;
pub const __USE_XOPEN2K: ::std::os::raw::c_uint = 1;
pub const __USE_XOPEN2K8: ::std::os::raw::c_uint = 1;
pub const _ATFILE_SOURCE: ::std::os::raw::c_uint = 1;
pub const __USE_MISC: ::std::os::raw::c_uint = 1;
pub const __USE_ATFILE: ::std::os::raw::c_uint = 1;
pub const __USE_FORTIFY_LEVEL: ::std::os::raw::c_uint = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: ::std::os::raw::c_uint = 0;
pub const _STDC_PREDEF_H: ::std::os::raw::c_uint = 1;
pub const __STDC_IEC_559__: ::std::os::raw::c_uint = 1;
pub const __STDC_IEC_559_COMPLEX__: ::std::os::raw::c_uint = 1;
pub const __STDC_ISO_10646__: ::std::os::raw::c_uint = 201706;
pub const __STDC_NO_THREADS__: ::std::os::raw::c_uint = 1;
pub const __GNU_LIBRARY__: ::std::os::raw::c_uint = 6;

pub const SIG_BLOCK: ::std::os::raw::c_uint = 0;
pub const SIG_UNBLOCK: ::std::os::raw::c_uint = 1;
pub const SIG_SETMASK: ::std::os::raw::c_uint = 2;
pub const _BITS_SIGCONTEXT_H: ::std::os::raw::c_uint = 1;
pub const FP_XSTATE_MAGIC1: ::std::os::raw::c_uint = 1179670611;
pub const FP_XSTATE_MAGIC2: ::std::os::raw::c_uint = 1179670597;
pub const __stack_t_defined: ::std::os::raw::c_uint = 1;
pub const _SYS_UCONTEXT_H: ::std::os::raw::c_uint = 1;
pub const __NGREG: ::std::os::raw::c_uint = 23;
pub const NGREG: ::std::os::raw::c_uint = 23;
pub const _BITS_SIGSTACK_H: ::std::os::raw::c_uint = 1;
pub const MINSIGSTKSZ: ::std::os::raw::c_uint = 2048;
pub const SIGSTKSZ: ::std::os::raw::c_uint = 8192;
pub const _BITS_SS_FLAGS_H: ::std::os::raw::c_uint = 1;
pub const __sigstack_defined: ::std::os::raw::c_uint = 1;
pub const _BITS_SIGTHREAD_H: ::std::os::raw::c_uint = 1;
extern "C" {
    pub fn __assert_fail(__assertion: *const ::std::os::raw::c_char,
                         __file: *const ::std::os::raw::c_char,
                         __line: ::std::os::raw::c_uint,
                         __function: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn __assert_perror_fail(__errnum: ::std::os::raw::c_int,
                                __file: *const ::std::os::raw::c_char,
                                __line: ::std::os::raw::c_uint,
                                __function: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn __assert(__assertion: *const ::std::os::raw::c_char,
                    __file: *const ::std::os::raw::c_char,
                    __line: ::std::os::raw::c_int);
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(::std::mem::size_of::<__fsid_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( __fsid_t ) ));
    assert_eq! (::std::mem::align_of::<__fsid_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __fsid_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __fsid_t ) ) . __val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __fsid_t ) , "::" ,
                stringify ! ( __val ) ));
}
impl Clone for __fsid_t {
    fn clone(&self) -> Self { *self }
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __qaddr_t = *mut __quad_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub __pad1: *mut ::std::os::raw::c_void,
    pub __pad2: *mut ::std::os::raw::c_void,
    pub __pad3: *mut ::std::os::raw::c_void,
    pub __pad4: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(::std::mem::size_of::<_IO_FILE>() , 216usize , concat ! (
               "Size of: " , stringify ! ( _IO_FILE ) ));
    assert_eq! (::std::mem::align_of::<_IO_FILE>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _IO_FILE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _flags as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_ptr as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_ptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_end as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_base as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_base as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_ptr as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_ptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_end as * const _
                as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_buf_base as * const _
                as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_buf_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_buf_end as * const _
                as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_buf_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_save_base as * const _
                as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_save_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_backup_base as * const
                _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_backup_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_save_end as * const _
                as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_save_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _markers as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _markers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _chain as * const _ as
                usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _chain ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _fileno as * const _ as
                usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _fileno ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _flags2 as * const _ as
                usize } , 116usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _flags2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _old_offset as * const _
                as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _old_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _cur_column as * const _
                as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _cur_column ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _vtable_offset as * const
                _ as usize } , 130usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _vtable_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _shortbuf as * const _ as
                usize } , 131usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _shortbuf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _lock as * const _ as
                usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _offset as * const _ as
                usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad1 as * const _ as
                usize } , 152usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad2 as * const _ as
                usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad3 as * const _ as
                usize } , 168usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad4 as * const _ as
                usize } , 176usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad5 as * const _ as
                usize } , 184usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _mode as * const _ as
                usize } , 192usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _mode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _unused2 as * const _ as
                usize } , 196usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _unused2 ) ));
}
impl Clone for _IO_FILE {
    fn clone(&self) -> Self { *self }
}
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Copy)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( __mbstate_t__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( __mbstate_t__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t__bindgen_ty_1 ) ) . __wch as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                __mbstate_t__bindgen_ty_1 ) , "::" , stringify ! ( __wch ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t__bindgen_ty_1 ) ) . __wchb as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                __mbstate_t__bindgen_ty_1 ) , "::" , stringify ! ( __wchb )
                ));
}
impl Clone for __mbstate_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(::std::mem::size_of::<__mbstate_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( __mbstate_t ) ));
    assert_eq! (::std::mem::align_of::<__mbstate_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __mbstate_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t ) ) . __count as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __mbstate_t ) , "::" ,
                stringify ! ( __count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t ) ) . __value as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( __mbstate_t ) , "::" ,
                stringify ! ( __value ) ));
}
impl Clone for __mbstate_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(::std::mem::size_of::<_G_fpos_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( _G_fpos_t ) ));
    assert_eq! (::std::mem::align_of::<_G_fpos_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _G_fpos_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos_t ) ) . __pos as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos_t ) , "::" ,
                stringify ! ( __pos ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos_t ) ) . __state as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos_t ) , "::" ,
                stringify ! ( __state ) ));
}
impl Clone for _G_fpos_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(::std::mem::size_of::<_G_fpos64_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( _G_fpos64_t ) ));
    assert_eq! (::std::mem::align_of::<_G_fpos64_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _G_fpos64_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos64_t ) ) . __pos as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos64_t ) , "::" ,
                stringify ! ( __pos ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos64_t ) ) . __state as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos64_t ) , "::" ,
                stringify ! ( __state ) ));
}
impl Clone for _G_fpos64_t {
    fn clone(&self) -> Self { *self }
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_jump_t {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__IO_marker() {
    assert_eq!(::std::mem::size_of::<_IO_marker>() , 24usize , concat ! (
               "Size of: " , stringify ! ( _IO_marker ) ));
    assert_eq! (::std::mem::align_of::<_IO_marker>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _IO_marker ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _next as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _sbuf as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _sbuf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _pos as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _pos ) ));
}
impl Clone for _IO_marker {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum __codecvt_result {
    __codecvt_ok = 0,
    __codecvt_partial = 1,
    __codecvt_error = 2,
    __codecvt_noconv = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE_plus {
    _unused: [u8; 0],
}
extern "C" {
    #[link_name = "_IO_2_1_stdin_"]
    pub static mut _IO_2_1_stdin_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "_IO_2_1_stdout_"]
    pub static mut _IO_2_1_stdout_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "_IO_2_1_stderr_"]
    pub static mut _IO_2_1_stderr_: _IO_FILE_plus;
}
pub type __io_read_fn =
    ::std::option::Option<unsafe extern "C" fn(__cookie:
                                                   *mut ::std::os::raw::c_void,
                                               __buf:
                                                   *mut ::std::os::raw::c_char,
                                               __nbytes: usize) -> __ssize_t>;
pub type __io_write_fn =
    ::std::option::Option<unsafe extern "C" fn(__cookie:
                                                   *mut ::std::os::raw::c_void,
                                               __buf:
                                                   *const ::std::os::raw::c_char,
                                               __n: usize) -> __ssize_t>;
pub type __io_seek_fn =
    ::std::option::Option<unsafe extern "C" fn(__cookie:
                                                   *mut ::std::os::raw::c_void,
                                               __pos: *mut __off64_t,
                                               __w: ::std::os::raw::c_int)
                              -> ::std::os::raw::c_int>;
pub type __io_close_fn =
    ::std::option::Option<unsafe extern "C" fn(__cookie:
                                                   *mut ::std::os::raw::c_void)
                              -> ::std::os::raw::c_int>;
extern "C" {
    pub fn __underflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __uflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_getc(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_putc(__c: ::std::os::raw::c_int, __fp: *mut _IO_FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_feof(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_ferror(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_peekc_locked(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_flockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_funlockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_ftrylockfile(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfscanf(arg1: *mut _IO_FILE,
                       arg2: *const ::std::os::raw::c_char,
                       arg3: *mut __va_list_tag,
                       arg4: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfprintf(arg1: *mut _IO_FILE,
                        arg2: *const ::std::os::raw::c_char,
                        arg3: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_padn(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int,
                    arg3: __ssize_t) -> __ssize_t;
}
extern "C" {
    pub fn _IO_sgetn(arg1: *mut _IO_FILE, arg2: *mut ::std::os::raw::c_void,
                     arg3: usize) -> usize;
}
extern "C" {
    pub fn _IO_seekoff(arg1: *mut _IO_FILE, arg2: __off64_t,
                       arg3: ::std::os::raw::c_int,
                       arg4: ::std::os::raw::c_int) -> __off64_t;
}
extern "C" {
    pub fn _IO_seekpos(arg1: *mut _IO_FILE, arg2: __off64_t,
                       arg3: ::std::os::raw::c_int) -> __off64_t;
}
extern "C" {
    pub fn _IO_free_backup_area(arg1: *mut _IO_FILE);
}
pub type off_t = __off_t;
pub type fpos_t = _G_fpos_t;
extern "C" {
    #[link_name = "stdin"]
    pub static mut stdin: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "stdout"]
    pub static mut stdout: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "stderr"]
    pub static mut stderr: *mut _IO_FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(__old: *const ::std::os::raw::c_char,
                  __new: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(__oldfd: ::std::os::raw::c_int,
                    __old: *const ::std::os::raw::c_char,
                    __newfd: ::std::os::raw::c_int,
                    __new: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(__dir: *const ::std::os::raw::c_char,
                   __pfx: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(__filename: *const ::std::os::raw::c_char,
                 __modes: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn freopen(__filename: *const ::std::os::raw::c_char,
                   __modes: *const ::std::os::raw::c_char,
                   __stream: *mut FILE) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int,
                  __modes: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(__s: *mut ::std::os::raw::c_void, __len: usize,
                    __modes: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(__bufloc: *mut *mut ::std::os::raw::c_char,
                          __sizeloc: *mut usize) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char,
                   __modes: ::std::os::raw::c_int, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char,
                     __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(__stream: *mut FILE,
                   __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(__s: *mut ::std::os::raw::c_char,
                   __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(__s: *mut FILE, __format: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(__format: *const ::std::os::raw::c_char,
                   __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(__s: *mut ::std::os::raw::c_char,
                    __format: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(__s: *mut ::std::os::raw::c_char, __maxlen: usize,
                    __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(__s: *mut ::std::os::raw::c_char, __maxlen: usize,
                     __format: *const ::std::os::raw::c_char,
                     __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(__fd: ::std::os::raw::c_int,
                    __fmt: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(__fd: ::std::os::raw::c_int,
                   __fmt: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(__stream: *mut FILE,
                  __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(__s: *const ::std::os::raw::c_char,
                  __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_fscanf"]
    pub fn fscanf1(__stream: *mut FILE,
                   __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_sscanf"]
    pub fn sscanf1(__s: *const ::std::os::raw::c_char,
                   __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(__s: *mut FILE, __format: *const ::std::os::raw::c_char,
                   __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(__format: *const ::std::os::raw::c_char,
                  __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(__s: *const ::std::os::raw::c_char,
                   __format: *const ::std::os::raw::c_char,
                   __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vfscanf"]
    pub fn vfscanf1(__s: *mut FILE, __format: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vscanf"]
    pub fn vscanf1(__format: *const ::std::os::raw::c_char,
                   __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vsscanf"]
    pub fn vsscanf1(__s: *const ::std::os::raw::c_char,
                    __format: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(__s: *mut ::std::os::raw::c_char, __n: ::std::os::raw::c_int,
                 __stream: *mut FILE) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(__lineptr: *mut *mut ::std::os::raw::c_char,
                      __n: *mut usize, __delimiter: ::std::os::raw::c_int,
                      __stream: *mut FILE) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(__lineptr: *mut *mut ::std::os::raw::c_char,
                    __n: *mut usize, __delimiter: ::std::os::raw::c_int,
                    __stream: *mut FILE) -> __ssize_t;
}
extern "C" {
    pub fn getline(__lineptr: *mut *mut ::std::os::raw::c_char,
                   __n: *mut usize, __stream: *mut FILE) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(__ptr: *mut ::std::os::raw::c_void, __size: usize,
                 __n: usize, __stream: *mut FILE) -> usize;
}
extern "C" {
    pub fn fwrite(__ptr: *const ::std::os::raw::c_void, __size: usize,
                  __n: usize, __s: *mut FILE) -> usize;
}
extern "C" {
    pub fn fread_unlocked(__ptr: *mut ::std::os::raw::c_void, __size: usize,
                          __n: usize, __stream: *mut FILE) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(__ptr: *const ::std::os::raw::c_void,
                           __size: usize, __n: usize, __stream: *mut FILE)
     -> usize;
}
extern "C" {
    pub fn fseek(__stream: *mut FILE, __off: ::std::os::raw::c_long,
                 __whence: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(__stream: *mut FILE, __off: __off_t,
                  __whence: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "sys_nerr"]
    pub static mut sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "sys_errlist"]
    pub static mut sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(__command: *const ::std::os::raw::c_char,
                 __modes: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn memcpy(__dest: *mut ::std::os::raw::c_void,
                  __src: *const ::std::os::raw::c_void, __n: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(__dest: *mut ::std::os::raw::c_void,
                   __src: *const ::std::os::raw::c_void, __n: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memccpy(__dest: *mut ::std::os::raw::c_void,
                   __src: *const ::std::os::raw::c_void,
                   __c: ::std::os::raw::c_int, __n: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(__s: *mut ::std::os::raw::c_void,
                  __c: ::std::os::raw::c_int, __n: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(__s1: *const ::std::os::raw::c_void,
                  __s2: *const ::std::os::raw::c_void, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(__s: *const ::std::os::raw::c_void,
                  __c: ::std::os::raw::c_int, __n: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcpy(__dest: *mut ::std::os::raw::c_char,
                  __src: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(__dest: *mut ::std::os::raw::c_char,
                   __src: *const ::std::os::raw::c_char, __n: usize)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(__dest: *mut ::std::os::raw::c_char,
                  __src: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(__dest: *mut ::std::os::raw::c_char,
                   __src: *const ::std::os::raw::c_char, __n: usize)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(__s1: *const ::std::os::raw::c_char,
                  __s2: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(__s1: *const ::std::os::raw::c_char,
                   __s2: *const ::std::os::raw::c_char, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(__s1: *const ::std::os::raw::c_char,
                   __s2: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(__dest: *mut ::std::os::raw::c_char,
                   __src: *const ::std::os::raw::c_char, __n: usize)
     -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(::std::mem::size_of::<__locale_struct>() , 232usize , concat !
               ( "Size of: " , stringify ! ( __locale_struct ) ));
    assert_eq! (::std::mem::align_of::<__locale_struct>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( __locale_struct ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __locales as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __locales ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __ctype_b as *
                const _ as usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __ctype_b ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __ctype_tolower as
                * const _ as usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __ctype_tolower ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __ctype_toupper as
                * const _ as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __ctype_toupper ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __names as * const
                _ as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __names ) ));
}
impl Clone for __locale_struct {
    fn clone(&self) -> Self { *self }
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strcoll_l(__s1: *const ::std::os::raw::c_char,
                     __s2: *const ::std::os::raw::c_char, __l: locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(__dest: *mut ::std::os::raw::c_char,
                     __src: *const ::std::os::raw::c_char, __n: usize,
                     __l: locale_t) -> usize;
}
extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(__string: *const ::std::os::raw::c_char, __n: usize)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(__s: *const ::std::os::raw::c_char,
                  __c: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(__s: *const ::std::os::raw::c_char,
                   __c: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(__s: *const ::std::os::raw::c_char,
                   __reject: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strspn(__s: *const ::std::os::raw::c_char,
                  __accept: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strpbrk(__s: *const ::std::os::raw::c_char,
                   __accept: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(__haystack: *const ::std::os::raw::c_char,
                  __needle: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(__s: *mut ::std::os::raw::c_char,
                  __delim: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __strtok_r(__s: *mut ::std::os::raw::c_char,
                      __delim: *const ::std::os::raw::c_char,
                      __save_ptr: *mut *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok_r(__s: *mut ::std::os::raw::c_char,
                    __delim: *const ::std::os::raw::c_char,
                    __save_ptr: *mut *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: usize)
     -> usize;
}
extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "__xpg_strerror_r"]
    pub fn strerror_r(__errnum: ::std::os::raw::c_int,
                      __buf: *mut ::std::os::raw::c_char, __buflen: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strerror_l(__errnum: ::std::os::raw::c_int, __l: locale_t)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn bcmp(__s1: *const ::std::os::raw::c_void,
                __s2: *const ::std::os::raw::c_void, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bcopy(__src: *const ::std::os::raw::c_void,
                 __dest: *mut ::std::os::raw::c_void, __n: usize);
}
extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
extern "C" {
    pub fn index(__s: *const ::std::os::raw::c_char,
                 __c: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(__s: *const ::std::os::raw::c_char,
                  __c: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(__s1: *const ::std::os::raw::c_char,
                      __s2: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(__s1: *const ::std::os::raw::c_char,
                       __s2: *const ::std::os::raw::c_char, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp_l(__s1: *const ::std::os::raw::c_char,
                        __s2: *const ::std::os::raw::c_char, __loc: locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp_l(__s1: *const ::std::os::raw::c_char,
                         __s2: *const ::std::os::raw::c_char, __n: usize,
                         __loc: locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
extern "C" {
    pub fn strsep(__stringp: *mut *mut ::std::os::raw::c_char,
                  __delim: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpcpy(__dest: *mut ::std::os::raw::c_char,
                    __src: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpcpy(__dest: *mut ::std::os::raw::c_char,
                  __src: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpncpy(__dest: *mut ::std::os::raw::c_char,
                     __src: *const ::std::os::raw::c_char, __n: usize)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(__dest: *mut ::std::os::raw::c_char,
                   __src: *const ::std::os::raw::c_char, __n: usize)
     -> *mut ::std::os::raw::c_char;
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(::std::mem::size_of::<div_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( div_t ) ));
    assert_eq! (::std::mem::align_of::<div_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( div_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const div_t ) ) . quot as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( div_t ) , "::" ,
                stringify ! ( quot ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const div_t ) ) . rem as * const _ as usize } ,
                4usize , concat ! (
                "Alignment of field: " , stringify ! ( div_t ) , "::" ,
                stringify ! ( rem ) ));
}
impl Clone for div_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(::std::mem::size_of::<ldiv_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( ldiv_t ) ));
    assert_eq! (::std::mem::align_of::<ldiv_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( ldiv_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ldiv_t ) ) . quot as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ldiv_t ) , "::" ,
                stringify ! ( quot ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ldiv_t ) ) . rem as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ldiv_t ) , "::" ,
                stringify ! ( rem ) ));
}
impl Clone for ldiv_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(::std::mem::size_of::<lldiv_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( lldiv_t ) ));
    assert_eq! (::std::mem::align_of::<lldiv_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( lldiv_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lldiv_t ) ) . quot as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( lldiv_t ) , "::" ,
                stringify ! ( quot ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lldiv_t ) ) . rem as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( lldiv_t ) , "::" ,
                stringify ! ( rem ) ));
}
impl Clone for lldiv_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn strtof(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char) -> f32;
}
extern "C" {
    pub fn strtold(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn strtol(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char,
                  __base: ::std::os::raw::c_int) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char,
                   __base: ::std::os::raw::c_int) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char,
                  __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char,
                   __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char,
                   __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(__nptr: *const ::std::os::raw::c_char,
                    __endptr: *mut *mut ::std::os::raw::c_char,
                    __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulong;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(::std::mem::size_of::<__sigset_t>() , 128usize , concat ! (
               "Size of: " , stringify ! ( __sigset_t ) ));
    assert_eq! (::std::mem::align_of::<__sigset_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( __sigset_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __sigset_t ) ) . __val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __sigset_t ) , "::" ,
                stringify ! ( __val ) ));
}
impl Clone for __sigset_t {
    fn clone(&self) -> Self { *self }
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(::std::mem::size_of::<timeval>() , 16usize , concat ! (
               "Size of: " , stringify ! ( timeval ) ));
    assert_eq! (::std::mem::align_of::<timeval>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( timeval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timeval ) ) . tv_sec as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timeval ) , "::" ,
                stringify ! ( tv_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timeval ) ) . tv_usec as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( timeval ) , "::" ,
                stringify ! ( tv_usec ) ));
}
impl Clone for timeval {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(::std::mem::size_of::<timespec>() , 16usize , concat ! (
               "Size of: " , stringify ! ( timespec ) ));
    assert_eq! (::std::mem::align_of::<timespec>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( timespec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_sec as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_nsec as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_nsec ) ));
}
impl Clone for timespec {
    fn clone(&self) -> Self { *self }
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(::std::mem::size_of::<fd_set>() , 128usize , concat ! (
               "Size of: " , stringify ! ( fd_set ) ));
    assert_eq! (::std::mem::align_of::<fd_set>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( fd_set ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fd_set ) ) . __fds_bits as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( fd_set ) , "::" ,
                stringify ! ( __fds_bits ) ));
}
impl Clone for fd_set {
    fn clone(&self) -> Self { *self }
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(__nfds: ::std::os::raw::c_int, __readfds: *mut fd_set,
                  __writefds: *mut fd_set, __exceptfds: *mut fd_set,
                  __timeout: *mut timeval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(__nfds: ::std::os::raw::c_int, __readfds: *mut fd_set,
                   __writefds: *mut fd_set, __exceptfds: *mut fd_set,
                   __timeout: *const timespec, __sigmask: *const __sigset_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gnu_dev_major(__dev: __dev_t) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_minor(__dev: __dev_t) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_makedev(__major: ::std::os::raw::c_uint,
                           __minor: ::std::os::raw::c_uint) -> __dev_t;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(::std::mem::size_of::<__pthread_rwlock_arch_t>() , 56usize ,
               concat ! (
               "Size of: " , stringify ! ( __pthread_rwlock_arch_t ) ));
    assert_eq! (::std::mem::align_of::<__pthread_rwlock_arch_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( __pthread_rwlock_arch_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __readers
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t
                ) , "::" , stringify ! ( __readers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __writers
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t
                ) , "::" , stringify ! ( __writers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) .
                __wrphase_futex as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t
                ) , "::" , stringify ! ( __wrphase_futex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) .
                __writers_futex as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t
                ) , "::" , stringify ! ( __writers_futex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __pad3 as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t
                ) , "::" , stringify ! ( __pad3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __pad4 as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t
                ) , "::" , stringify ! ( __pad4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) .
                __cur_writer as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t
                ) , "::" , stringify ! ( __cur_writer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __shared as
                * const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t
                ) , "::" , stringify ! ( __shared ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __rwelision
                as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t
                ) , "::" , stringify ! ( __rwelision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __pad1 as *
                const _ as usize } , 33usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t
                ) , "::" , stringify ! ( __pad1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __pad2 as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t
                ) , "::" , stringify ! ( __pad2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __flags as
                * const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t
                ) , "::" , stringify ! ( __flags ) ));
}
impl Clone for __pthread_rwlock_arch_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(::std::mem::size_of::<__pthread_internal_list>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( __pthread_internal_list ) ));
    assert_eq! (::std::mem::align_of::<__pthread_internal_list>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( __pthread_internal_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_internal_list ) ) . __prev as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_internal_list
                ) , "::" , stringify ! ( __prev ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_internal_list ) ) . __next as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_internal_list
                ) , "::" , stringify ! ( __next ) ));
}
impl Clone for __pthread_internal_list {
    fn clone(&self) -> Self { *self }
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(::std::mem::size_of::<__pthread_mutex_s>() , 40usize , concat !
               ( "Size of: " , stringify ! ( __pthread_mutex_s ) ));
    assert_eq! (::std::mem::align_of::<__pthread_mutex_s>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( __pthread_mutex_s ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_mutex_s ) ) . __lock as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_mutex_s ) ,
                "::" , stringify ! ( __lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_mutex_s ) ) . __count as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_mutex_s ) ,
                "::" , stringify ! ( __count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_mutex_s ) ) . __owner as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_mutex_s ) ,
                "::" , stringify ! ( __owner ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_mutex_s ) ) . __nusers as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_mutex_s ) ,
                "::" , stringify ! ( __nusers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_mutex_s ) ) . __kind as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_mutex_s ) ,
                "::" , stringify ! ( __kind ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_mutex_s ) ) . __spins as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_mutex_s ) ,
                "::" , stringify ! ( __spins ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_mutex_s ) ) . __elision as *
                const _ as usize } , 22usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_mutex_s ) ,
                "::" , stringify ! ( __elision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_mutex_s ) ) . __list as * const
                _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_mutex_s ) ,
                "::" , stringify ! ( __list ) ));
}
impl Clone for __pthread_mutex_s {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>()
               , 8usize , concat ! (
               "Size of: " , stringify ! (
               __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>()
                , 4usize , concat ! (
                "Alignment of " , stringify ! (
                __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const __pthread_cond_s__bindgen_ty_1__bindgen_ty_1
                ) ) . __low as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 ) , "::" ,
                stringify ! ( __low ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const __pthread_cond_s__bindgen_ty_1__bindgen_ty_1
                ) ) . __high as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 ) , "::" ,
                stringify ! ( __high ) ));
}
impl Clone for __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>() ,
               8usize , concat ! (
               "Size of: " , stringify ! ( __pthread_cond_s__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( __pthread_cond_s__bindgen_ty_1
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_cond_s__bindgen_ty_1 ) ) .
                __wseq as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                __pthread_cond_s__bindgen_ty_1 ) , "::" , stringify ! ( __wseq
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_cond_s__bindgen_ty_1 ) ) .
                __wseq32 as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                __pthread_cond_s__bindgen_ty_1 ) , "::" , stringify ! (
                __wseq32 ) ));
}
impl Clone for __pthread_cond_s__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>()
               , 8usize , concat ! (
               "Size of: " , stringify ! (
               __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>()
                , 4usize , concat ! (
                "Alignment of " , stringify ! (
                __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const __pthread_cond_s__bindgen_ty_2__bindgen_ty_1
                ) ) . __low as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 ) , "::" ,
                stringify ! ( __low ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const __pthread_cond_s__bindgen_ty_2__bindgen_ty_1
                ) ) . __high as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 ) , "::" ,
                stringify ! ( __high ) ));
}
impl Clone for __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>() ,
               8usize , concat ! (
               "Size of: " , stringify ! ( __pthread_cond_s__bindgen_ty_2 )
               ));
    assert_eq! (::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( __pthread_cond_s__bindgen_ty_2
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_cond_s__bindgen_ty_2 ) ) .
                __g1_start as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                __pthread_cond_s__bindgen_ty_2 ) , "::" , stringify ! (
                __g1_start ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_cond_s__bindgen_ty_2 ) ) .
                __g1_start32 as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                __pthread_cond_s__bindgen_ty_2 ) , "::" , stringify ! (
                __g1_start32 ) ));
}
impl Clone for __pthread_cond_s__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(::std::mem::size_of::<__pthread_cond_s>() , 48usize , concat !
               ( "Size of: " , stringify ! ( __pthread_cond_s ) ));
    assert_eq! (::std::mem::align_of::<__pthread_cond_s>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( __pthread_cond_s ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_cond_s ) ) . __g_refs as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_cond_s ) ,
                "::" , stringify ! ( __g_refs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_cond_s ) ) . __g_size as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_cond_s ) ,
                "::" , stringify ! ( __g_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_cond_s ) ) . __g1_orig_size as
                * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_cond_s ) ,
                "::" , stringify ! ( __g1_orig_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_cond_s ) ) . __wrefs as * const
                _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_cond_s ) ,
                "::" , stringify ! ( __wrefs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_cond_s ) ) . __g_signals as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_cond_s ) ,
                "::" , stringify ! ( __g_signals ) ));
}
impl Clone for __pthread_cond_s {
    fn clone(&self) -> Self { *self }
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_mutexattr_t>() , 4usize , concat
               ! ( "Size of: " , stringify ! ( pthread_mutexattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_mutexattr_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_mutexattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutexattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutexattr_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutexattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutexattr_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_mutexattr_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_condattr_t>() , 4usize , concat !
               ( "Size of: " , stringify ! ( pthread_condattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_condattr_t>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( pthread_condattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_condattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_condattr_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_condattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_condattr_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_condattr_t {
    fn clone(&self) -> Self { *self }
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(::std::mem::size_of::<pthread_attr_t>() , 56usize , concat ! (
               "Size of: " , stringify ! ( pthread_attr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_attr_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_attr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_attr_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_attr_t ) , "::"
                , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_attr_t ) ) . __align as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_attr_t ) , "::"
                , stringify ! ( __align ) ));
}
impl Clone for pthread_attr_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(::std::mem::size_of::<pthread_mutex_t>() , 40usize , concat ! (
               "Size of: " , stringify ! ( pthread_mutex_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_mutex_t>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( pthread_mutex_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __data as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __align as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_mutex_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(::std::mem::size_of::<pthread_cond_t>() , 48usize , concat ! (
               "Size of: " , stringify ! ( pthread_cond_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_cond_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_cond_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __data as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __align as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __align ) ));
}
impl Clone for pthread_cond_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(::std::mem::size_of::<pthread_rwlock_t>() , 56usize , concat !
               ( "Size of: " , stringify ! ( pthread_rwlock_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_rwlock_t>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( pthread_rwlock_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __data as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __size as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __align as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_rwlock_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_rwlockattr_t>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( pthread_rwlockattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_rwlockattr_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_rwlockattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlockattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlockattr_t )
                , "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlockattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlockattr_t )
                , "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_rwlockattr_t {
    fn clone(&self) -> Self { *self }
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(::std::mem::size_of::<pthread_barrier_t>() , 32usize , concat !
               ( "Size of: " , stringify ! ( pthread_barrier_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_barrier_t>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( pthread_barrier_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrier_t ) ) . __size as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrier_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrier_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrier_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_barrier_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_barrierattr_t>() , 4usize ,
               concat ! ( "Size of: " , stringify ! ( pthread_barrierattr_t )
               ));
    assert_eq! (::std::mem::align_of::<pthread_barrierattr_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_barrierattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrierattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrierattr_t )
                , "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrierattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrierattr_t )
                , "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_barrierattr_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(__seed: ::std::os::raw::c_uint,
                     __statebuf: *mut ::std::os::raw::c_char,
                     __statelen: usize) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(::std::mem::size_of::<random_data>() , 48usize , concat ! (
               "Size of: " , stringify ! ( random_data ) ));
    assert_eq! (::std::mem::align_of::<random_data>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( random_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . fptr as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( fptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rptr as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . state as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rand_type as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rand_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rand_deg as * const _
                as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rand_deg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rand_sep as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rand_sep ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . end_ptr as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( end_ptr ) ));
}
impl Clone for random_data {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(__seed: ::std::os::raw::c_uint, __buf: *mut random_data)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(__seed: ::std::os::raw::c_uint,
                       __statebuf: *mut ::std::os::raw::c_char,
                       __statelen: usize, __buf: *mut random_data)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(__statebuf: *mut ::std::os::raw::c_char,
                      __buf: *mut random_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort)
     -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort)
     -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort)
     -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(::std::mem::size_of::<drand48_data>() , 24usize , concat ! (
               "Size of: " , stringify ! ( drand48_data ) ));
    assert_eq! (::std::mem::align_of::<drand48_data>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( drand48_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __x as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __old_x as * const _
                as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __old_x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __c as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __c ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __init as * const _ as
                usize } , 14usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __init ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __a as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __a ) ));
}
impl Clone for drand48_data {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(__xsubi: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data, __result: *mut f64)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(__buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(__xsubi: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(__buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(__xsubi: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(__seedval: ::std::os::raw::c_long,
                     __buffer: *mut drand48_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(__seed16v: *mut ::std::os::raw::c_ushort,
                    __buffer: *mut drand48_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(__param: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(__nmemb: usize, __size: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(__ptr: *mut ::std::os::raw::c_void, __size: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn alloca(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(__memptr: *mut *mut ::std::os::raw::c_void,
                          __alignment: usize, __size: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: usize, __size: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(__func:
                             ::std::option::Option<unsafe extern "C" fn()>)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(__func:
                       ::std::option::Option<unsafe extern "C" fn(__status:
                                                                      ::std::os::raw::c_int,
                                                                  __arg:
                                                                      *mut ::std::os::raw::c_void)>,
                   __arg: *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(__name: *const ::std::os::raw::c_char,
                  __value: *const ::std::os::raw::c_char,
                  __replace: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(__template: *mut ::std::os::raw::c_char,
                    __suffixlen: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realpath(__name: *const ::std::os::raw::c_char,
                    __resolved: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t =
    ::std::option::Option<unsafe extern "C" fn(arg1:
                                                   *const ::std::os::raw::c_void,
                                               arg2:
                                                   *const ::std::os::raw::c_void)
                              -> ::std::os::raw::c_int>;
extern "C" {
    pub fn bsearch(__key: *const ::std::os::raw::c_void,
                   __base: *const ::std::os::raw::c_void, __nmemb: usize,
                   __size: usize, __compar: __compar_fn_t)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(__base: *mut ::std::os::raw::c_void, __nmemb: usize,
                 __size: usize, __compar: __compar_fn_t);
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int)
     -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long,
                __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(__numer: ::std::os::raw::c_longlong,
                 __denom: ::std::os::raw::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                __decpt: *mut ::std::os::raw::c_int,
                __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                __decpt: *mut ::std::os::raw::c_int,
                __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                __buf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                 __decpt: *mut ::std::os::raw::c_int,
                 __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                 __decpt: *mut ::std::os::raw::c_int,
                 __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                 __buf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                  __decpt: *mut ::std::os::raw::c_int,
                  __sign: *mut ::std::os::raw::c_int,
                  __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                  __decpt: *mut ::std::os::raw::c_int,
                  __sign: *mut ::std::os::raw::c_int,
                  __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                   __decpt: *mut ::std::os::raw::c_int,
                   __sign: *mut ::std::os::raw::c_int,
                   __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                   __decpt: *mut ::std::os::raw::c_int,
                   __sign: *mut ::std::os::raw::c_int,
                   __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(__pwc: *mut wchar_t, __s: *const ::std::os::raw::c_char,
                  __n: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char,
                    __n: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t,
                    __n: usize) -> usize;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(__optionp: *mut *mut ::std::os::raw::c_char,
                     __tokens: *const *const ::std::os::raw::c_char,
                     __valuep: *mut *mut ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(::std::mem::size_of::<max_align_t>() , 32usize , concat ! (
               "Size of: " , stringify ! ( max_align_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const max_align_t ) ) .
                __clang_max_align_nonce1 as * const _ as usize } , 0usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( max_align_t ) , "::" ,
                stringify ! ( __clang_max_align_nonce1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const max_align_t ) ) .
                __clang_max_align_nonce2 as * const _ as usize } , 16usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( max_align_t ) , "::" ,
                stringify ! ( __clang_max_align_nonce2 ) ));
}
impl Clone for max_align_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    assert_eq!(::std::mem::size_of::<tm>() , 56usize , concat ! (
               "Size of: " , stringify ! ( tm ) ));
    assert_eq! (::std::mem::align_of::<tm>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( tm ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_sec as * const _ as usize } ,
                0usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_min as * const _ as usize } ,
                4usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_min ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_hour as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_hour ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_mday as * const _ as usize }
                , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_mday ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_mon as * const _ as usize } ,
                16usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_mon ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_year as * const _ as usize }
                , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_year ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_wday as * const _ as usize }
                , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_wday ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_yday as * const _ as usize }
                , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_yday ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_isdst as * const _ as usize }
                , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_isdst ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_gmtoff as * const _ as usize
                } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_gmtoff ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_zone as * const _ as usize }
                , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_zone ) ));
}
impl Clone for tm {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    assert_eq!(::std::mem::size_of::<itimerspec>() , 32usize , concat ! (
               "Size of: " , stringify ! ( itimerspec ) ));
    assert_eq! (::std::mem::align_of::<itimerspec>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( itimerspec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const itimerspec ) ) . it_interval as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( itimerspec ) , "::" ,
                stringify ! ( it_interval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const itimerspec ) ) . it_value as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( itimerspec ) , "::" ,
                stringify ! ( it_value ) ));
}
impl Clone for itimerspec {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct sigevent {
    pub sigev_value: sigval_t,
    pub sigev_signo: ::std::os::raw::c_int,
    pub sigev_notify: ::std::os::raw::c_int,
    pub _sigev_un: sigevent__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy)]
pub union sigevent__bindgen_ty_1 {
    pub _pad: [::std::os::raw::c_int; 12usize],
    pub _tid: __pid_t,
    pub _sigev_thread: sigevent__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: [u64; 6usize],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct sigevent__bindgen_ty_1__bindgen_ty_1 {
    pub _function: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                  sigval_t)>,
    pub _attribute: *mut pthread_attr_t,
}
#[test]
fn bindgen_test_layout_sigevent__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<sigevent__bindgen_ty_1__bindgen_ty_1>() ,
               16usize , concat ! (
               "Size of: " , stringify ! (
               sigevent__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<sigevent__bindgen_ty_1__bindgen_ty_1>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                sigevent__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sigevent__bindgen_ty_1__bindgen_ty_1 ) )
                . _function as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                sigevent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! (
                _function ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sigevent__bindgen_ty_1__bindgen_ty_1 ) )
                . _attribute as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                sigevent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! (
                _attribute ) ));
}
impl Clone for sigevent__bindgen_ty_1__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_sigevent__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<sigevent__bindgen_ty_1>() , 48usize ,
               concat ! ( "Size of: " , stringify ! ( sigevent__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<sigevent__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( sigevent__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sigevent__bindgen_ty_1 ) ) . _pad as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sigevent__bindgen_ty_1
                ) , "::" , stringify ! ( _pad ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sigevent__bindgen_ty_1 ) ) . _tid as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sigevent__bindgen_ty_1
                ) , "::" , stringify ! ( _tid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sigevent__bindgen_ty_1 ) ) .
                _sigev_thread as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sigevent__bindgen_ty_1
                ) , "::" , stringify ! ( _sigev_thread ) ));
}
impl Clone for sigevent__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_sigevent() {
    assert_eq!(::std::mem::size_of::<sigevent>() , 64usize , concat ! (
               "Size of: " , stringify ! ( sigevent ) ));
    assert_eq! (::std::mem::align_of::<sigevent>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( sigevent ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sigevent ) ) . sigev_value as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sigevent ) , "::" ,
                stringify ! ( sigev_value ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sigevent ) ) . sigev_signo as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( sigevent ) , "::" ,
                stringify ! ( sigev_signo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sigevent ) ) . sigev_notify as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( sigevent ) , "::" ,
                stringify ! ( sigev_notify ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sigevent ) ) . _sigev_un as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( sigevent ) , "::" ,
                stringify ! ( _sigev_un ) ));
}
impl Clone for sigevent {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(__s: *mut ::std::os::raw::c_char, __maxsize: usize,
                    __format: *const ::std::os::raw::c_char, __tp: *const tm)
     -> usize;
}
extern "C" {
    pub fn strftime_l(__s: *mut ::std::os::raw::c_char, __maxsize: usize,
                      __format: *const ::std::os::raw::c_char,
                      __tp: *const tm, __loc: locale_t) -> usize;
}
extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn asctime_r(__tp: *const tm, __buf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime_r(__timer: *const time_t, __buf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "__tzname"]
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    #[link_name = "__daylight"]
    pub static mut __daylight: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__timezone"]
    pub static mut __timezone: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "tzname"]
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    #[link_name = "daylight"]
    pub static mut daylight: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "timezone"]
    pub static mut timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub fn stime(__when: *const time_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nanosleep(__requested_time: *const timespec,
                     __remaining: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_nanosleep(__clock_id: clockid_t,
                           __flags: ::std::os::raw::c_int,
                           __req: *const timespec, __rem: *mut timespec)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_create(__clock_id: clockid_t, __evp: *mut sigevent,
                        __timerid: *mut timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_settime(__timerid: timer_t, __flags: ::std::os::raw::c_int,
                         __value: *const itimerspec,
                         __ovalue: *mut itimerspec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timespec_get(__ts: *mut timespec, __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
pub const _ISupper: _bindgen_ty_1 = _bindgen_ty_1::_ISupper;
pub const _ISlower: _bindgen_ty_1 = _bindgen_ty_1::_ISlower;
pub const _ISalpha: _bindgen_ty_1 = _bindgen_ty_1::_ISalpha;
pub const _ISdigit: _bindgen_ty_1 = _bindgen_ty_1::_ISdigit;
pub const _ISxdigit: _bindgen_ty_1 = _bindgen_ty_1::_ISxdigit;
pub const _ISspace: _bindgen_ty_1 = _bindgen_ty_1::_ISspace;
pub const _ISprint: _bindgen_ty_1 = _bindgen_ty_1::_ISprint;
pub const _ISgraph: _bindgen_ty_1 = _bindgen_ty_1::_ISgraph;
pub const _ISblank: _bindgen_ty_1 = _bindgen_ty_1::_ISblank;
pub const _IScntrl: _bindgen_ty_1 = _bindgen_ty_1::_IScntrl;
pub const _ISpunct: _bindgen_ty_1 = _bindgen_ty_1::_ISpunct;
pub const _ISalnum: _bindgen_ty_1 = _bindgen_ty_1::_ISalnum;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_1 {
    _ISupper = 256,
    _ISlower = 512,
    _ISalpha = 1024,
    _ISdigit = 2048,
    _ISxdigit = 4096,
    _ISspace = 8192,
    _ISprint = 16384,
    _ISgraph = 32768,
    _ISblank = 1,
    _IScntrl = 2,
    _ISpunct = 4,
    _ISalnum = 8,
}
extern "C" {
    pub fn __ctype_b_loc() -> *mut *const ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn __ctype_tolower_loc() -> *mut *const __int32_t;
}
extern "C" {
    pub fn __ctype_toupper_loc() -> *mut *const __int32_t;
}
extern "C" {
    pub fn isalnum(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isalpha(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iscntrl(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isdigit(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn islower(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isgraph(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isprint(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ispunct(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isspace(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isupper(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isxdigit(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tolower(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn toupper(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isblank(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isascii(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn toascii(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _toupper(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _tolower(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isalnum_l(arg1: ::std::os::raw::c_int, arg2: locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isalpha_l(arg1: ::std::os::raw::c_int, arg2: locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iscntrl_l(arg1: ::std::os::raw::c_int, arg2: locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isdigit_l(arg1: ::std::os::raw::c_int, arg2: locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn islower_l(arg1: ::std::os::raw::c_int, arg2: locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isgraph_l(arg1: ::std::os::raw::c_int, arg2: locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isprint_l(arg1: ::std::os::raw::c_int, arg2: locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ispunct_l(arg1: ::std::os::raw::c_int, arg2: locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isspace_l(arg1: ::std::os::raw::c_int, arg2: locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isupper_l(arg1: ::std::os::raw::c_int, arg2: locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isxdigit_l(arg1: ::std::os::raw::c_int, arg2: locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isblank_l(arg1: ::std::os::raw::c_int, arg2: locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __tolower_l(__c: ::std::os::raw::c_int, __l: locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tolower_l(__c: ::std::os::raw::c_int, __l: locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __toupper_l(__c: ::std::os::raw::c_int, __l: locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn toupper_l(__c: ::std::os::raw::c_int, __l: locale_t)
     -> ::std::os::raw::c_int;
}
pub const CRYPT_OK: _bindgen_ty_2 = _bindgen_ty_2::CRYPT_OK;
pub const CRYPT_ERROR: _bindgen_ty_2 = _bindgen_ty_2::CRYPT_ERROR;
pub const CRYPT_NOP: _bindgen_ty_2 = _bindgen_ty_2::CRYPT_NOP;
pub const CRYPT_INVALID_KEYSIZE: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_INVALID_KEYSIZE;
pub const CRYPT_INVALID_ROUNDS: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_INVALID_ROUNDS;
pub const CRYPT_FAIL_TESTVECTOR: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_FAIL_TESTVECTOR;
pub const CRYPT_BUFFER_OVERFLOW: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_BUFFER_OVERFLOW;
pub const CRYPT_INVALID_PACKET: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_INVALID_PACKET;
pub const CRYPT_INVALID_PRNGSIZE: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_INVALID_PRNGSIZE;
pub const CRYPT_ERROR_READPRNG: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_ERROR_READPRNG;
pub const CRYPT_INVALID_CIPHER: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_INVALID_CIPHER;
pub const CRYPT_INVALID_HASH: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_INVALID_HASH;
pub const CRYPT_INVALID_PRNG: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_INVALID_PRNG;
pub const CRYPT_MEM: _bindgen_ty_2 = _bindgen_ty_2::CRYPT_MEM;
pub const CRYPT_PK_TYPE_MISMATCH: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_PK_TYPE_MISMATCH;
pub const CRYPT_PK_NOT_PRIVATE: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_PK_NOT_PRIVATE;
pub const CRYPT_INVALID_ARG: _bindgen_ty_2 = _bindgen_ty_2::CRYPT_INVALID_ARG;
pub const CRYPT_FILE_NOTFOUND: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_FILE_NOTFOUND;
pub const CRYPT_PK_INVALID_TYPE: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_PK_INVALID_TYPE;
pub const CRYPT_OVERFLOW: _bindgen_ty_2 = _bindgen_ty_2::CRYPT_OVERFLOW;
pub const CRYPT_UNUSED1: _bindgen_ty_2 = _bindgen_ty_2::CRYPT_UNUSED1;
pub const CRYPT_INPUT_TOO_LONG: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_INPUT_TOO_LONG;
pub const CRYPT_PK_INVALID_SIZE: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_PK_INVALID_SIZE;
pub const CRYPT_INVALID_PRIME_SIZE: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_INVALID_PRIME_SIZE;
pub const CRYPT_PK_INVALID_PADDING: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_PK_INVALID_PADDING;
pub const CRYPT_HASH_OVERFLOW: _bindgen_ty_2 =
    _bindgen_ty_2::CRYPT_HASH_OVERFLOW;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_2 {
    CRYPT_OK = 0,
    CRYPT_ERROR = 1,
    CRYPT_NOP = 2,
    CRYPT_INVALID_KEYSIZE = 3,
    CRYPT_INVALID_ROUNDS = 4,
    CRYPT_FAIL_TESTVECTOR = 5,
    CRYPT_BUFFER_OVERFLOW = 6,
    CRYPT_INVALID_PACKET = 7,
    CRYPT_INVALID_PRNGSIZE = 8,
    CRYPT_ERROR_READPRNG = 9,
    CRYPT_INVALID_CIPHER = 10,
    CRYPT_INVALID_HASH = 11,
    CRYPT_INVALID_PRNG = 12,
    CRYPT_MEM = 13,
    CRYPT_PK_TYPE_MISMATCH = 14,
    CRYPT_PK_NOT_PRIVATE = 15,
    CRYPT_INVALID_ARG = 16,
    CRYPT_FILE_NOTFOUND = 17,
    CRYPT_PK_INVALID_TYPE = 18,
    CRYPT_OVERFLOW = 19,
    CRYPT_UNUSED1 = 20,
    CRYPT_INPUT_TOO_LONG = 21,
    CRYPT_PK_INVALID_SIZE = 22,
    CRYPT_INVALID_PRIME_SIZE = 23,
    CRYPT_PK_INVALID_PADDING = 24,
    CRYPT_HASH_OVERFLOW = 25,
}
pub type ulong64 = ::std::os::raw::c_ulonglong;
pub type ulong32 = ::std::os::raw::c_uint;
pub type ltc_mp_digit = ::std::os::raw::c_ulonglong;
pub type LTC_FAST_TYPE = ulong64;
#[repr(C)]
#[derive(Copy)]
pub struct blowfish_key {
    pub S: [[ulong32; 256usize]; 4usize],
    pub K: [ulong32; 18usize],
}
#[test]
fn bindgen_test_layout_blowfish_key() {
    assert_eq!(::std::mem::size_of::<blowfish_key>() , 4168usize , concat ! (
               "Size of: " , stringify ! ( blowfish_key ) ));
    assert_eq! (::std::mem::align_of::<blowfish_key>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( blowfish_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const blowfish_key ) ) . S as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( blowfish_key ) , "::" ,
                stringify ! ( S ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const blowfish_key ) ) . K as * const _ as
                usize } , 4096usize , concat ! (
                "Alignment of field: " , stringify ! ( blowfish_key ) , "::" ,
                stringify ! ( K ) ));
}
impl Clone for blowfish_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct rc5_key {
    pub rounds: ::std::os::raw::c_int,
    pub K: [ulong32; 50usize],
}
#[test]
fn bindgen_test_layout_rc5_key() {
    assert_eq!(::std::mem::size_of::<rc5_key>() , 204usize , concat ! (
               "Size of: " , stringify ! ( rc5_key ) ));
    assert_eq! (::std::mem::align_of::<rc5_key>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( rc5_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rc5_key ) ) . rounds as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rc5_key ) , "::" ,
                stringify ! ( rounds ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rc5_key ) ) . K as * const _ as usize } ,
                4usize , concat ! (
                "Alignment of field: " , stringify ! ( rc5_key ) , "::" ,
                stringify ! ( K ) ));
}
impl Clone for rc5_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct rc6_key {
    pub K: [ulong32; 44usize],
}
#[test]
fn bindgen_test_layout_rc6_key() {
    assert_eq!(::std::mem::size_of::<rc6_key>() , 176usize , concat ! (
               "Size of: " , stringify ! ( rc6_key ) ));
    assert_eq! (::std::mem::align_of::<rc6_key>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( rc6_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rc6_key ) ) . K as * const _ as usize } ,
                0usize , concat ! (
                "Alignment of field: " , stringify ! ( rc6_key ) , "::" ,
                stringify ! ( K ) ));
}
impl Clone for rc6_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct saferp_key {
    pub K: [[::std::os::raw::c_uchar; 16usize]; 33usize],
    pub rounds: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_saferp_key() {
    assert_eq!(::std::mem::size_of::<saferp_key>() , 536usize , concat ! (
               "Size of: " , stringify ! ( saferp_key ) ));
    assert_eq! (::std::mem::align_of::<saferp_key>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( saferp_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const saferp_key ) ) . K as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( saferp_key ) , "::" ,
                stringify ! ( K ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const saferp_key ) ) . rounds as * const _ as
                usize } , 528usize , concat ! (
                "Alignment of field: " , stringify ! ( saferp_key ) , "::" ,
                stringify ! ( rounds ) ));
}
impl Clone for saferp_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct rijndael_key {
    pub eK: [ulong32; 60usize],
    pub dK: [ulong32; 60usize],
    pub Nr: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_rijndael_key() {
    assert_eq!(::std::mem::size_of::<rijndael_key>() , 484usize , concat ! (
               "Size of: " , stringify ! ( rijndael_key ) ));
    assert_eq! (::std::mem::align_of::<rijndael_key>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( rijndael_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rijndael_key ) ) . eK as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rijndael_key ) , "::" ,
                stringify ! ( eK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rijndael_key ) ) . dK as * const _ as
                usize } , 240usize , concat ! (
                "Alignment of field: " , stringify ! ( rijndael_key ) , "::" ,
                stringify ! ( dK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rijndael_key ) ) . Nr as * const _ as
                usize } , 480usize , concat ! (
                "Alignment of field: " , stringify ! ( rijndael_key ) , "::" ,
                stringify ! ( Nr ) ));
}
impl Clone for rijndael_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct kseed_key {
    pub K: [ulong32; 32usize],
    pub dK: [ulong32; 32usize],
}
#[test]
fn bindgen_test_layout_kseed_key() {
    assert_eq!(::std::mem::size_of::<kseed_key>() , 256usize , concat ! (
               "Size of: " , stringify ! ( kseed_key ) ));
    assert_eq! (::std::mem::align_of::<kseed_key>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( kseed_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const kseed_key ) ) . K as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( kseed_key ) , "::" ,
                stringify ! ( K ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const kseed_key ) ) . dK as * const _ as usize
                } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( kseed_key ) , "::" ,
                stringify ! ( dK ) ));
}
impl Clone for kseed_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct kasumi_key {
    pub KLi1: [ulong32; 8usize],
    pub KLi2: [ulong32; 8usize],
    pub KOi1: [ulong32; 8usize],
    pub KOi2: [ulong32; 8usize],
    pub KOi3: [ulong32; 8usize],
    pub KIi1: [ulong32; 8usize],
    pub KIi2: [ulong32; 8usize],
    pub KIi3: [ulong32; 8usize],
}
#[test]
fn bindgen_test_layout_kasumi_key() {
    assert_eq!(::std::mem::size_of::<kasumi_key>() , 256usize , concat ! (
               "Size of: " , stringify ! ( kasumi_key ) ));
    assert_eq! (::std::mem::align_of::<kasumi_key>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( kasumi_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const kasumi_key ) ) . KLi1 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( kasumi_key ) , "::" ,
                stringify ! ( KLi1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const kasumi_key ) ) . KLi2 as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( kasumi_key ) , "::" ,
                stringify ! ( KLi2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const kasumi_key ) ) . KOi1 as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( kasumi_key ) , "::" ,
                stringify ! ( KOi1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const kasumi_key ) ) . KOi2 as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( kasumi_key ) , "::" ,
                stringify ! ( KOi2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const kasumi_key ) ) . KOi3 as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( kasumi_key ) , "::" ,
                stringify ! ( KOi3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const kasumi_key ) ) . KIi1 as * const _ as
                usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( kasumi_key ) , "::" ,
                stringify ! ( KIi1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const kasumi_key ) ) . KIi2 as * const _ as
                usize } , 192usize , concat ! (
                "Alignment of field: " , stringify ! ( kasumi_key ) , "::" ,
                stringify ! ( KIi2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const kasumi_key ) ) . KIi3 as * const _ as
                usize } , 224usize , concat ! (
                "Alignment of field: " , stringify ! ( kasumi_key ) , "::" ,
                stringify ! ( KIi3 ) ));
}
impl Clone for kasumi_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xtea_key {
    pub A: [::std::os::raw::c_ulong; 32usize],
    pub B: [::std::os::raw::c_ulong; 32usize],
}
#[test]
fn bindgen_test_layout_xtea_key() {
    assert_eq!(::std::mem::size_of::<xtea_key>() , 512usize , concat ! (
               "Size of: " , stringify ! ( xtea_key ) ));
    assert_eq! (::std::mem::align_of::<xtea_key>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( xtea_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xtea_key ) ) . A as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xtea_key ) , "::" ,
                stringify ! ( A ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xtea_key ) ) . B as * const _ as usize }
                , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( xtea_key ) , "::" ,
                stringify ! ( B ) ));
}
impl Clone for xtea_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct twofish_key {
    pub S: [[ulong32; 256usize]; 4usize],
    pub K: [ulong32; 40usize],
}
#[test]
fn bindgen_test_layout_twofish_key() {
    assert_eq!(::std::mem::size_of::<twofish_key>() , 4256usize , concat ! (
               "Size of: " , stringify ! ( twofish_key ) ));
    assert_eq! (::std::mem::align_of::<twofish_key>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( twofish_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const twofish_key ) ) . S as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( twofish_key ) , "::" ,
                stringify ! ( S ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const twofish_key ) ) . K as * const _ as usize
                } , 4096usize , concat ! (
                "Alignment of field: " , stringify ! ( twofish_key ) , "::" ,
                stringify ! ( K ) ));
}
impl Clone for twofish_key {
    fn clone(&self) -> Self { *self }
}
pub type safer_block_t = [::std::os::raw::c_uchar; 8usize];
pub type safer_key_t = [::std::os::raw::c_uchar; 217usize];
#[repr(C)]
#[derive(Copy)]
pub struct safer_key {
    pub key: safer_key_t,
}
#[test]
fn bindgen_test_layout_safer_key() {
    assert_eq!(::std::mem::size_of::<safer_key>() , 217usize , concat ! (
               "Size of: " , stringify ! ( safer_key ) ));
    assert_eq! (::std::mem::align_of::<safer_key>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( safer_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const safer_key ) ) . key as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( safer_key ) , "::" ,
                stringify ! ( key ) ));
}
impl Clone for safer_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct rc2_key {
    pub xkey: [::std::os::raw::c_uint; 64usize],
}
#[test]
fn bindgen_test_layout_rc2_key() {
    assert_eq!(::std::mem::size_of::<rc2_key>() , 256usize , concat ! (
               "Size of: " , stringify ! ( rc2_key ) ));
    assert_eq! (::std::mem::align_of::<rc2_key>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( rc2_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rc2_key ) ) . xkey as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rc2_key ) , "::" ,
                stringify ! ( xkey ) ));
}
impl Clone for rc2_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct des_key {
    pub ek: [ulong32; 32usize],
    pub dk: [ulong32; 32usize],
}
#[test]
fn bindgen_test_layout_des_key() {
    assert_eq!(::std::mem::size_of::<des_key>() , 256usize , concat ! (
               "Size of: " , stringify ! ( des_key ) ));
    assert_eq! (::std::mem::align_of::<des_key>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( des_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const des_key ) ) . ek as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( des_key ) , "::" ,
                stringify ! ( ek ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const des_key ) ) . dk as * const _ as usize }
                , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( des_key ) , "::" ,
                stringify ! ( dk ) ));
}
impl Clone for des_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct des3_key {
    pub ek: [[ulong32; 32usize]; 3usize],
    pub dk: [[ulong32; 32usize]; 3usize],
}
#[test]
fn bindgen_test_layout_des3_key() {
    assert_eq!(::std::mem::size_of::<des3_key>() , 768usize , concat ! (
               "Size of: " , stringify ! ( des3_key ) ));
    assert_eq! (::std::mem::align_of::<des3_key>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( des3_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const des3_key ) ) . ek as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( des3_key ) , "::" ,
                stringify ! ( ek ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const des3_key ) ) . dk as * const _ as usize }
                , 384usize , concat ! (
                "Alignment of field: " , stringify ! ( des3_key ) , "::" ,
                stringify ! ( dk ) ));
}
impl Clone for des3_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cast5_key {
    pub K: [ulong32; 32usize],
    pub keylen: ulong32,
}
#[test]
fn bindgen_test_layout_cast5_key() {
    assert_eq!(::std::mem::size_of::<cast5_key>() , 132usize , concat ! (
               "Size of: " , stringify ! ( cast5_key ) ));
    assert_eq! (::std::mem::align_of::<cast5_key>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( cast5_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cast5_key ) ) . K as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cast5_key ) , "::" ,
                stringify ! ( K ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cast5_key ) ) . keylen as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( cast5_key ) , "::" ,
                stringify ! ( keylen ) ));
}
impl Clone for cast5_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct noekeon_key {
    pub K: [ulong32; 4usize],
    pub dK: [ulong32; 4usize],
}
#[test]
fn bindgen_test_layout_noekeon_key() {
    assert_eq!(::std::mem::size_of::<noekeon_key>() , 32usize , concat ! (
               "Size of: " , stringify ! ( noekeon_key ) ));
    assert_eq! (::std::mem::align_of::<noekeon_key>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( noekeon_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const noekeon_key ) ) . K as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( noekeon_key ) , "::" ,
                stringify ! ( K ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const noekeon_key ) ) . dK as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( noekeon_key ) , "::" ,
                stringify ! ( dK ) ));
}
impl Clone for noekeon_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct skipjack_key {
    pub key: [::std::os::raw::c_uchar; 10usize],
}
#[test]
fn bindgen_test_layout_skipjack_key() {
    assert_eq!(::std::mem::size_of::<skipjack_key>() , 10usize , concat ! (
               "Size of: " , stringify ! ( skipjack_key ) ));
    assert_eq! (::std::mem::align_of::<skipjack_key>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( skipjack_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const skipjack_key ) ) . key as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( skipjack_key ) , "::" ,
                stringify ! ( key ) ));
}
impl Clone for skipjack_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct khazad_key {
    pub roundKeyEnc: [ulong64; 9usize],
    pub roundKeyDec: [ulong64; 9usize],
}
#[test]
fn bindgen_test_layout_khazad_key() {
    assert_eq!(::std::mem::size_of::<khazad_key>() , 144usize , concat ! (
               "Size of: " , stringify ! ( khazad_key ) ));
    assert_eq! (::std::mem::align_of::<khazad_key>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( khazad_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const khazad_key ) ) . roundKeyEnc as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( khazad_key ) , "::" ,
                stringify ! ( roundKeyEnc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const khazad_key ) ) . roundKeyDec as * const _
                as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( khazad_key ) , "::" ,
                stringify ! ( roundKeyDec ) ));
}
impl Clone for khazad_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct anubis_key {
    pub keyBits: ::std::os::raw::c_int,
    pub R: ::std::os::raw::c_int,
    pub roundKeyEnc: [[ulong32; 4usize]; 19usize],
    pub roundKeyDec: [[ulong32; 4usize]; 19usize],
}
#[test]
fn bindgen_test_layout_anubis_key() {
    assert_eq!(::std::mem::size_of::<anubis_key>() , 616usize , concat ! (
               "Size of: " , stringify ! ( anubis_key ) ));
    assert_eq! (::std::mem::align_of::<anubis_key>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( anubis_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const anubis_key ) ) . keyBits as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( anubis_key ) , "::" ,
                stringify ! ( keyBits ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const anubis_key ) ) . R as * const _ as usize
                } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( anubis_key ) , "::" ,
                stringify ! ( R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const anubis_key ) ) . roundKeyEnc as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( anubis_key ) , "::" ,
                stringify ! ( roundKeyEnc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const anubis_key ) ) . roundKeyDec as * const _
                as usize } , 312usize , concat ! (
                "Alignment of field: " , stringify ! ( anubis_key ) , "::" ,
                stringify ! ( roundKeyDec ) ));
}
impl Clone for anubis_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct multi2_key {
    pub N: ::std::os::raw::c_int,
    pub uk: [ulong32; 8usize],
}
#[test]
fn bindgen_test_layout_multi2_key() {
    assert_eq!(::std::mem::size_of::<multi2_key>() , 36usize , concat ! (
               "Size of: " , stringify ! ( multi2_key ) ));
    assert_eq! (::std::mem::align_of::<multi2_key>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( multi2_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const multi2_key ) ) . N as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( multi2_key ) , "::" ,
                stringify ! ( N ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const multi2_key ) ) . uk as * const _ as usize
                } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( multi2_key ) , "::" ,
                stringify ! ( uk ) ));
}
impl Clone for multi2_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct camellia_key {
    pub R: ::std::os::raw::c_int,
    pub kw: [ulong64; 4usize],
    pub k: [ulong64; 24usize],
    pub kl: [ulong64; 6usize],
}
#[test]
fn bindgen_test_layout_camellia_key() {
    assert_eq!(::std::mem::size_of::<camellia_key>() , 280usize , concat ! (
               "Size of: " , stringify ! ( camellia_key ) ));
    assert_eq! (::std::mem::align_of::<camellia_key>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( camellia_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const camellia_key ) ) . R as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( camellia_key ) , "::" ,
                stringify ! ( R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const camellia_key ) ) . kw as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( camellia_key ) , "::" ,
                stringify ! ( kw ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const camellia_key ) ) . k as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( camellia_key ) , "::" ,
                stringify ! ( k ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const camellia_key ) ) . kl as * const _ as
                usize } , 232usize , concat ! (
                "Alignment of field: " , stringify ! ( camellia_key ) , "::" ,
                stringify ! ( kl ) ));
}
impl Clone for camellia_key {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union Symmetric_key {
    pub des: des_key,
    pub des3: des3_key,
    pub rc2: rc2_key,
    pub safer: safer_key,
    pub twofish: twofish_key,
    pub blowfish: blowfish_key,
    pub rc5: rc5_key,
    pub rc6: rc6_key,
    pub saferp: saferp_key,
    pub rijndael: rijndael_key,
    pub xtea: xtea_key,
    pub cast5: cast5_key,
    pub noekeon: noekeon_key,
    pub skipjack: skipjack_key,
    pub khazad: khazad_key,
    pub anubis: anubis_key,
    pub kseed: kseed_key,
    pub kasumi: kasumi_key,
    pub multi2: multi2_key,
    pub camellia: camellia_key,
    pub data: *mut ::std::os::raw::c_void,
    _bindgen_union_align: [u64; 532usize],
}
#[test]
fn bindgen_test_layout_Symmetric_key() {
    assert_eq!(::std::mem::size_of::<Symmetric_key>() , 4256usize , concat ! (
               "Size of: " , stringify ! ( Symmetric_key ) ));
    assert_eq! (::std::mem::align_of::<Symmetric_key>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Symmetric_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . des as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( des ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . des3 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( des3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . rc2 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( rc2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . safer as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( safer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . twofish as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( twofish ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . blowfish as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( blowfish ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . rc5 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( rc5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . rc6 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( rc6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . saferp as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( saferp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . rijndael as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( rijndael ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . xtea as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( xtea ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . cast5 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( cast5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . noekeon as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( noekeon ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . skipjack as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( skipjack ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . khazad as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( khazad ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . anubis as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( anubis ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . kseed as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( kseed ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . kasumi as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( kasumi ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . multi2 as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( multi2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . camellia as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( camellia ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Symmetric_key ) ) . data as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Symmetric_key ) , "::"
                , stringify ! ( data ) ));
}
impl Clone for Symmetric_key {
    fn clone(&self) -> Self { *self }
}
pub type symmetric_key = Symmetric_key;
/// A block cipher ECB structure
#[repr(C)]
#[derive(Copy)]
pub struct symmetric_ECB {
    /// The index of the cipher chosen
    pub cipher: ::std::os::raw::c_int,
    /// The block size of the given cipher
    pub blocklen: ::std::os::raw::c_int,
    /// The scheduled key
    pub key: symmetric_key,
}
#[test]
fn bindgen_test_layout_symmetric_ECB() {
    assert_eq!(::std::mem::size_of::<symmetric_ECB>() , 4264usize , concat ! (
               "Size of: " , stringify ! ( symmetric_ECB ) ));
    assert_eq! (::std::mem::align_of::<symmetric_ECB>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( symmetric_ECB ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_ECB ) ) . cipher as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_ECB ) , "::"
                , stringify ! ( cipher ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_ECB ) ) . blocklen as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_ECB ) , "::"
                , stringify ! ( blocklen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_ECB ) ) . key as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_ECB ) , "::"
                , stringify ! ( key ) ));
}
impl Clone for symmetric_ECB {
    fn clone(&self) -> Self { *self }
}
/// A block cipher CFB structure
#[repr(C)]
#[derive(Copy)]
pub struct symmetric_CFB {
    /// The index of the cipher chosen
    pub cipher: ::std::os::raw::c_int,
    /// The block size of the given cipher
    pub blocklen: ::std::os::raw::c_int,
    /// The padding offset
    pub padlen: ::std::os::raw::c_int,
    /// The current IV
    pub IV: [::std::os::raw::c_uchar; 128usize],
    /// The pad used to encrypt/decrypt
    pub pad: [::std::os::raw::c_uchar; 128usize],
    /// The scheduled key
    pub key: symmetric_key,
}
#[test]
fn bindgen_test_layout_symmetric_CFB() {
    assert_eq!(::std::mem::size_of::<symmetric_CFB>() , 4528usize , concat ! (
               "Size of: " , stringify ! ( symmetric_CFB ) ));
    assert_eq! (::std::mem::align_of::<symmetric_CFB>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( symmetric_CFB ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CFB ) ) . cipher as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CFB ) , "::"
                , stringify ! ( cipher ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CFB ) ) . blocklen as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CFB ) , "::"
                , stringify ! ( blocklen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CFB ) ) . padlen as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CFB ) , "::"
                , stringify ! ( padlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CFB ) ) . IV as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CFB ) , "::"
                , stringify ! ( IV ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CFB ) ) . pad as * const _ as
                usize } , 140usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CFB ) , "::"
                , stringify ! ( pad ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CFB ) ) . key as * const _ as
                usize } , 272usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CFB ) , "::"
                , stringify ! ( key ) ));
}
impl Clone for symmetric_CFB {
    fn clone(&self) -> Self { *self }
}
/// A block cipher OFB structure
#[repr(C)]
#[derive(Copy)]
pub struct symmetric_OFB {
    /// The index of the cipher chosen
    pub cipher: ::std::os::raw::c_int,
    /// The block size of the given cipher
    pub blocklen: ::std::os::raw::c_int,
    /// The padding offset
    pub padlen: ::std::os::raw::c_int,
    /// The current IV
    pub IV: [::std::os::raw::c_uchar; 128usize],
    /// The scheduled key
    pub key: symmetric_key,
}
#[test]
fn bindgen_test_layout_symmetric_OFB() {
    assert_eq!(::std::mem::size_of::<symmetric_OFB>() , 4400usize , concat ! (
               "Size of: " , stringify ! ( symmetric_OFB ) ));
    assert_eq! (::std::mem::align_of::<symmetric_OFB>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( symmetric_OFB ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_OFB ) ) . cipher as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_OFB ) , "::"
                , stringify ! ( cipher ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_OFB ) ) . blocklen as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_OFB ) , "::"
                , stringify ! ( blocklen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_OFB ) ) . padlen as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_OFB ) , "::"
                , stringify ! ( padlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_OFB ) ) . IV as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_OFB ) , "::"
                , stringify ! ( IV ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_OFB ) ) . key as * const _ as
                usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_OFB ) , "::"
                , stringify ! ( key ) ));
}
impl Clone for symmetric_OFB {
    fn clone(&self) -> Self { *self }
}
/// A block cipher CBC structure
#[repr(C)]
#[derive(Copy)]
pub struct symmetric_CBC {
    /// The index of the cipher chosen
    pub cipher: ::std::os::raw::c_int,
    /// The block size of the given cipher
    pub blocklen: ::std::os::raw::c_int,
    /// The current IV
    pub IV: [::std::os::raw::c_uchar; 128usize],
    /// The scheduled key
    pub key: symmetric_key,
}
#[test]
fn bindgen_test_layout_symmetric_CBC() {
    assert_eq!(::std::mem::size_of::<symmetric_CBC>() , 4392usize , concat ! (
               "Size of: " , stringify ! ( symmetric_CBC ) ));
    assert_eq! (::std::mem::align_of::<symmetric_CBC>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( symmetric_CBC ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CBC ) ) . cipher as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CBC ) , "::"
                , stringify ! ( cipher ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CBC ) ) . blocklen as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CBC ) , "::"
                , stringify ! ( blocklen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CBC ) ) . IV as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CBC ) , "::"
                , stringify ! ( IV ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CBC ) ) . key as * const _ as
                usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CBC ) , "::"
                , stringify ! ( key ) ));
}
impl Clone for symmetric_CBC {
    fn clone(&self) -> Self { *self }
}
/// A block cipher CTR structure
#[repr(C)]
#[derive(Copy)]
pub struct symmetric_CTR {
    /// The index of the cipher chosen
    pub cipher: ::std::os::raw::c_int,
    /// The block size of the given cipher
    pub blocklen: ::std::os::raw::c_int,
    /// The padding offset
    pub padlen: ::std::os::raw::c_int,
    /// The mode (endianess) of the CTR, 0==little, 1==big
    pub mode: ::std::os::raw::c_int,
    /// counter width
    pub ctrlen: ::std::os::raw::c_int,
    /// The counter
    pub ctr: [::std::os::raw::c_uchar; 128usize],
    /// The pad used to encrypt/decrypt
    pub pad: [::std::os::raw::c_uchar; 128usize],
    /// The scheduled key
    pub key: symmetric_key,
}
#[test]
fn bindgen_test_layout_symmetric_CTR() {
    assert_eq!(::std::mem::size_of::<symmetric_CTR>() , 4536usize , concat ! (
               "Size of: " , stringify ! ( symmetric_CTR ) ));
    assert_eq! (::std::mem::align_of::<symmetric_CTR>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( symmetric_CTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CTR ) ) . cipher as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CTR ) , "::"
                , stringify ! ( cipher ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CTR ) ) . blocklen as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CTR ) , "::"
                , stringify ! ( blocklen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CTR ) ) . padlen as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CTR ) , "::"
                , stringify ! ( padlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CTR ) ) . mode as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CTR ) , "::"
                , stringify ! ( mode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CTR ) ) . ctrlen as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CTR ) , "::"
                , stringify ! ( ctrlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CTR ) ) . ctr as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CTR ) , "::"
                , stringify ! ( ctr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CTR ) ) . pad as * const _ as
                usize } , 148usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CTR ) , "::"
                , stringify ! ( pad ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_CTR ) ) . key as * const _ as
                usize } , 280usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_CTR ) , "::"
                , stringify ! ( key ) ));
}
impl Clone for symmetric_CTR {
    fn clone(&self) -> Self { *self }
}
/// A LRW structure
#[repr(C)]
#[derive(Copy)]
pub struct symmetric_LRW {
    /// The index of the cipher chosen (must be a 128-bit block cipher)
    pub cipher: ::std::os::raw::c_int,
    /// The current IV
    pub IV: [::std::os::raw::c_uchar; 16usize],
    /// the tweak key
    pub tweak: [::std::os::raw::c_uchar; 16usize],
    /// The current pad, it's the product of the first 15 bytes against the tweak key
    pub pad: [::std::os::raw::c_uchar; 16usize],
    /// The scheduled symmetric key
    pub key: symmetric_key,
    /// The pre-computed multiplication table
    pub PC: [[[::std::os::raw::c_uchar; 16usize]; 256usize]; 16usize],
}
#[test]
fn bindgen_test_layout_symmetric_LRW() {
    assert_eq!(::std::mem::size_of::<symmetric_LRW>() , 69848usize , concat !
               ( "Size of: " , stringify ! ( symmetric_LRW ) ));
    assert_eq! (::std::mem::align_of::<symmetric_LRW>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( symmetric_LRW ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_LRW ) ) . cipher as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_LRW ) , "::"
                , stringify ! ( cipher ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_LRW ) ) . IV as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_LRW ) , "::"
                , stringify ! ( IV ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_LRW ) ) . tweak as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_LRW ) , "::"
                , stringify ! ( tweak ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_LRW ) ) . pad as * const _ as
                usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_LRW ) , "::"
                , stringify ! ( pad ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_LRW ) ) . key as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_LRW ) , "::"
                , stringify ! ( key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_LRW ) ) . PC as * const _ as
                usize } , 4312usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_LRW ) , "::"
                , stringify ! ( PC ) ));
}
impl Clone for symmetric_LRW {
    fn clone(&self) -> Self { *self }
}
/// A block cipher F8 structure
#[repr(C)]
#[derive(Copy)]
pub struct symmetric_F8 {
    /// The index of the cipher chosen
    pub cipher: ::std::os::raw::c_int,
    /// The block size of the given cipher
    pub blocklen: ::std::os::raw::c_int,
    /// The padding offset
    pub padlen: ::std::os::raw::c_int,
    /// The current IV
    pub IV: [::std::os::raw::c_uchar; 128usize],
    /// The current IV
    pub MIV: [::std::os::raw::c_uchar; 128usize],
    /// Current block count
    pub blockcnt: ulong32,
    /// The scheduled key
    pub key: symmetric_key,
}
#[test]
fn bindgen_test_layout_symmetric_F8() {
    assert_eq!(::std::mem::size_of::<symmetric_F8>() , 4528usize , concat ! (
               "Size of: " , stringify ! ( symmetric_F8 ) ));
    assert_eq! (::std::mem::align_of::<symmetric_F8>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( symmetric_F8 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_F8 ) ) . cipher as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_F8 ) , "::" ,
                stringify ! ( cipher ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_F8 ) ) . blocklen as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_F8 ) , "::" ,
                stringify ! ( blocklen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_F8 ) ) . padlen as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_F8 ) , "::" ,
                stringify ! ( padlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_F8 ) ) . IV as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_F8 ) , "::" ,
                stringify ! ( IV ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_F8 ) ) . MIV as * const _ as
                usize } , 140usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_F8 ) , "::" ,
                stringify ! ( MIV ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_F8 ) ) . blockcnt as * const _
                as usize } , 268usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_F8 ) , "::" ,
                stringify ! ( blockcnt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_F8 ) ) . key as * const _ as
                usize } , 272usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_F8 ) , "::" ,
                stringify ! ( key ) ));
}
impl Clone for symmetric_F8 {
    fn clone(&self) -> Self { *self }
}
/// cipher descriptor table, last entry has "name == NULL" to mark the end of table
#[repr(C)]
#[derive(Copy)]
pub struct ltc_cipher_descriptor {
    /// name of cipher
    pub name: *const ::std::os::raw::c_char,
    /// internal ID
    pub ID: ::std::os::raw::c_uchar,
    /// min keysize (octets)
    pub min_key_length: ::std::os::raw::c_int,
    /// max keysize (octets)
    pub max_key_length: ::std::os::raw::c_int,
    /// block size (octets)
    pub block_length: ::std::os::raw::c_int,
    /// default number of rounds
    pub default_rounds: ::std::os::raw::c_int,
    /// Setup the cipher
    /// @param key         The input symmetric key
    /// @param keylen      The length of the input key (octets)
    /// @param num_rounds  The requested number of rounds (0==default)
    /// @param skey        [out] The destination of the scheduled key
    /// @return CRYPT_OK if successful
    pub setup: ::std::option::Option<unsafe extern "C" fn(key:
                                                              *const ::std::os::raw::c_uchar,
                                                          keylen:
                                                              ::std::os::raw::c_int,
                                                          num_rounds:
                                                              ::std::os::raw::c_int,
                                                          skey:
                                                              *mut symmetric_key)
                                         -> ::std::os::raw::c_int>,
    /// Encrypt a block
    /// @param pt      The plaintext
    /// @param ct      [out] The ciphertext
    /// @param skey    The scheduled key
    /// @return CRYPT_OK if successful
    pub ecb_encrypt: ::std::option::Option<unsafe extern "C" fn(pt:
                                                                    *const ::std::os::raw::c_uchar,
                                                                ct:
                                                                    *mut ::std::os::raw::c_uchar,
                                                                skey:
                                                                    *mut symmetric_key)
                                               -> ::std::os::raw::c_int>,
    /// Decrypt a block
    /// @param ct      The ciphertext
    /// @param pt      [out] The plaintext
    /// @param skey    The scheduled key
    /// @return CRYPT_OK if successful
    pub ecb_decrypt: ::std::option::Option<unsafe extern "C" fn(ct:
                                                                    *const ::std::os::raw::c_uchar,
                                                                pt:
                                                                    *mut ::std::os::raw::c_uchar,
                                                                skey:
                                                                    *mut symmetric_key)
                                               -> ::std::os::raw::c_int>,
    /// Test the block cipher
    /// @return CRYPT_OK if successful, CRYPT_NOP if self-testing has been disabled
    pub test: ::std::option::Option<unsafe extern "C" fn()
                                        -> ::std::os::raw::c_int>,
    /// Terminate the context
    /// @param skey    The scheduled key
    pub done: ::std::option::Option<unsafe extern "C" fn(skey:
                                                             *mut symmetric_key)>,
    /// Determine a key size
    /// @param keysize    [in/out] The size of the key desired and the suggested size
    /// @return CRYPT_OK if successful
    pub keysize: ::std::option::Option<unsafe extern "C" fn(keysize:
                                                                *mut ::std::os::raw::c_int)
                                           -> ::std::os::raw::c_int>,
    /// Accelerators **/
    /// /** Accelerated ECB encryption
    /// @param pt      Plaintext
    /// @param ct      Ciphertext
    /// @param blocks  The number of complete blocks to process
    /// @param skey    The scheduled key context
    /// @return CRYPT_OK if successful
    pub accel_ecb_encrypt: ::std::option::Option<unsafe extern "C" fn(pt:
                                                                          *const ::std::os::raw::c_uchar,
                                                                      ct:
                                                                          *mut ::std::os::raw::c_uchar,
                                                                      blocks:
                                                                          ::std::os::raw::c_ulong,
                                                                      skey:
                                                                          *mut symmetric_key)
                                                     ->
                                                         ::std::os::raw::c_int>,
    /// Accelerated ECB decryption
    /// @param pt      Plaintext
    /// @param ct      Ciphertext
    /// @param blocks  The number of complete blocks to process
    /// @param skey    The scheduled key context
    /// @return CRYPT_OK if successful
    pub accel_ecb_decrypt: ::std::option::Option<unsafe extern "C" fn(ct:
                                                                          *const ::std::os::raw::c_uchar,
                                                                      pt:
                                                                          *mut ::std::os::raw::c_uchar,
                                                                      blocks:
                                                                          ::std::os::raw::c_ulong,
                                                                      skey:
                                                                          *mut symmetric_key)
                                                     ->
                                                         ::std::os::raw::c_int>,
    /// Accelerated CBC encryption
    /// @param pt      Plaintext
    /// @param ct      Ciphertext
    /// @param blocks  The number of complete blocks to process
    /// @param IV      The initial value (input/output)
    /// @param skey    The scheduled key context
    /// @return CRYPT_OK if successful
    pub accel_cbc_encrypt: ::std::option::Option<unsafe extern "C" fn(pt:
                                                                          *const ::std::os::raw::c_uchar,
                                                                      ct:
                                                                          *mut ::std::os::raw::c_uchar,
                                                                      blocks:
                                                                          ::std::os::raw::c_ulong,
                                                                      IV:
                                                                          *mut ::std::os::raw::c_uchar,
                                                                      skey:
                                                                          *mut symmetric_key)
                                                     ->
                                                         ::std::os::raw::c_int>,
    /// Accelerated CBC decryption
    /// @param pt      Plaintext
    /// @param ct      Ciphertext
    /// @param blocks  The number of complete blocks to process
    /// @param IV      The initial value (input/output)
    /// @param skey    The scheduled key context
    /// @return CRYPT_OK if successful
    pub accel_cbc_decrypt: ::std::option::Option<unsafe extern "C" fn(ct:
                                                                          *const ::std::os::raw::c_uchar,
                                                                      pt:
                                                                          *mut ::std::os::raw::c_uchar,
                                                                      blocks:
                                                                          ::std::os::raw::c_ulong,
                                                                      IV:
                                                                          *mut ::std::os::raw::c_uchar,
                                                                      skey:
                                                                          *mut symmetric_key)
                                                     ->
                                                         ::std::os::raw::c_int>,
    /// Accelerated CTR encryption
    /// @param pt      Plaintext
    /// @param ct      Ciphertext
    /// @param blocks  The number of complete blocks to process
    /// @param IV      The initial value (input/output)
    /// @param mode    little or big endian counter (mode=0 or mode=1)
    /// @param skey    The scheduled key context
    /// @return CRYPT_OK if successful
    pub accel_ctr_encrypt: ::std::option::Option<unsafe extern "C" fn(pt:
                                                                          *const ::std::os::raw::c_uchar,
                                                                      ct:
                                                                          *mut ::std::os::raw::c_uchar,
                                                                      blocks:
                                                                          ::std::os::raw::c_ulong,
                                                                      IV:
                                                                          *mut ::std::os::raw::c_uchar,
                                                                      mode:
                                                                          ::std::os::raw::c_int,
                                                                      skey:
                                                                          *mut symmetric_key)
                                                     ->
                                                         ::std::os::raw::c_int>,
    /// Accelerated LRW
    /// @param pt      Plaintext
    /// @param ct      Ciphertext
    /// @param blocks  The number of complete blocks to process
    /// @param IV      The initial value (input/output)
    /// @param tweak   The LRW tweak
    /// @param skey    The scheduled key context
    /// @return CRYPT_OK if successful
    pub accel_lrw_encrypt: ::std::option::Option<unsafe extern "C" fn(pt:
                                                                          *const ::std::os::raw::c_uchar,
                                                                      ct:
                                                                          *mut ::std::os::raw::c_uchar,
                                                                      blocks:
                                                                          ::std::os::raw::c_ulong,
                                                                      IV:
                                                                          *mut ::std::os::raw::c_uchar,
                                                                      tweak:
                                                                          *const ::std::os::raw::c_uchar,
                                                                      skey:
                                                                          *mut symmetric_key)
                                                     ->
                                                         ::std::os::raw::c_int>,
    /// Accelerated LRW
    /// @param ct      Ciphertext
    /// @param pt      Plaintext
    /// @param blocks  The number of complete blocks to process
    /// @param IV      The initial value (input/output)
    /// @param tweak   The LRW tweak
    /// @param skey    The scheduled key context
    /// @return CRYPT_OK if successful
    pub accel_lrw_decrypt: ::std::option::Option<unsafe extern "C" fn(ct:
                                                                          *const ::std::os::raw::c_uchar,
                                                                      pt:
                                                                          *mut ::std::os::raw::c_uchar,
                                                                      blocks:
                                                                          ::std::os::raw::c_ulong,
                                                                      IV:
                                                                          *mut ::std::os::raw::c_uchar,
                                                                      tweak:
                                                                          *const ::std::os::raw::c_uchar,
                                                                      skey:
                                                                          *mut symmetric_key)
                                                     ->
                                                         ::std::os::raw::c_int>,
    /// Accelerated CCM packet (one-shot)
    /// @param key        The secret key to use
    /// @param keylen     The length of the secret key (octets)
    /// @param uskey      A previously scheduled key [optional can be NULL]
    /// @param nonce      The session nonce [use once]
    /// @param noncelen   The length of the nonce
    /// @param header     The header for the session
    /// @param headerlen  The length of the header (octets)
    /// @param pt         [out] The plaintext
    /// @param ptlen      The length of the plaintext (octets)
    /// @param ct         [out] The ciphertext
    /// @param tag        [out] The destination tag
    /// @param taglen     [in/out] The max size and resulting size of the authentication tag
    /// @param direction  Encrypt or Decrypt direction (0 or 1)
    /// @return CRYPT_OK if successful
    pub accel_ccm_memory: ::std::option::Option<unsafe extern "C" fn(key:
                                                                         *const ::std::os::raw::c_uchar,
                                                                     keylen:
                                                                         ::std::os::raw::c_ulong,
                                                                     uskey:
                                                                         *mut symmetric_key,
                                                                     nonce:
                                                                         *const ::std::os::raw::c_uchar,
                                                                     noncelen:
                                                                         ::std::os::raw::c_ulong,
                                                                     header:
                                                                         *const ::std::os::raw::c_uchar,
                                                                     headerlen:
                                                                         ::std::os::raw::c_ulong,
                                                                     pt:
                                                                         *mut ::std::os::raw::c_uchar,
                                                                     ptlen:
                                                                         ::std::os::raw::c_ulong,
                                                                     ct:
                                                                         *mut ::std::os::raw::c_uchar,
                                                                     tag:
                                                                         *mut ::std::os::raw::c_uchar,
                                                                     taglen:
                                                                         *mut ::std::os::raw::c_ulong,
                                                                     direction:
                                                                         ::std::os::raw::c_int)
                                                    -> ::std::os::raw::c_int>,
    /// Accelerated GCM packet (one shot)
    /// @param key        The secret key
    /// @param keylen     The length of the secret key
    /// @param IV         The initialization vector
    /// @param IVlen      The length of the initialization vector
    /// @param adata      The additional authentication data (header)
    /// @param adatalen   The length of the adata
    /// @param pt         The plaintext
    /// @param ptlen      The length of the plaintext (ciphertext length is the same)
    /// @param ct         The ciphertext
    /// @param tag        [out] The MAC tag
    /// @param taglen     [in/out] The MAC tag length
    /// @param direction  Encrypt or Decrypt mode (GCM_ENCRYPT or GCM_DECRYPT)
    /// @return CRYPT_OK on success
    pub accel_gcm_memory: ::std::option::Option<unsafe extern "C" fn(key:
                                                                         *const ::std::os::raw::c_uchar,
                                                                     keylen:
                                                                         ::std::os::raw::c_ulong,
                                                                     IV:
                                                                         *const ::std::os::raw::c_uchar,
                                                                     IVlen:
                                                                         ::std::os::raw::c_ulong,
                                                                     adata:
                                                                         *const ::std::os::raw::c_uchar,
                                                                     adatalen:
                                                                         ::std::os::raw::c_ulong,
                                                                     pt:
                                                                         *mut ::std::os::raw::c_uchar,
                                                                     ptlen:
                                                                         ::std::os::raw::c_ulong,
                                                                     ct:
                                                                         *mut ::std::os::raw::c_uchar,
                                                                     tag:
                                                                         *mut ::std::os::raw::c_uchar,
                                                                     taglen:
                                                                         *mut ::std::os::raw::c_ulong,
                                                                     direction:
                                                                         ::std::os::raw::c_int)
                                                    -> ::std::os::raw::c_int>,
    /// Accelerated one shot LTC_OMAC
    /// @param key            The secret key
    /// @param keylen         The key length (octets)
    /// @param in             The message
    /// @param inlen          Length of message (octets)
    /// @param out            [out] Destination for tag
    /// @param outlen         [in/out] Initial and final size of out
    /// @return CRYPT_OK on success
    pub omac_memory: ::std::option::Option<unsafe extern "C" fn(key:
                                                                    *const ::std::os::raw::c_uchar,
                                                                keylen:
                                                                    ::std::os::raw::c_ulong,
                                                                in_:
                                                                    *const ::std::os::raw::c_uchar,
                                                                inlen:
                                                                    ::std::os::raw::c_ulong,
                                                                out:
                                                                    *mut ::std::os::raw::c_uchar,
                                                                outlen:
                                                                    *mut ::std::os::raw::c_ulong)
                                               -> ::std::os::raw::c_int>,
    /// Accelerated one shot XCBC
    /// @param key            The secret key
    /// @param keylen         The key length (octets)
    /// @param in             The message
    /// @param inlen          Length of message (octets)
    /// @param out            [out] Destination for tag
    /// @param outlen         [in/out] Initial and final size of out
    /// @return CRYPT_OK on success
    pub xcbc_memory: ::std::option::Option<unsafe extern "C" fn(key:
                                                                    *const ::std::os::raw::c_uchar,
                                                                keylen:
                                                                    ::std::os::raw::c_ulong,
                                                                in_:
                                                                    *const ::std::os::raw::c_uchar,
                                                                inlen:
                                                                    ::std::os::raw::c_ulong,
                                                                out:
                                                                    *mut ::std::os::raw::c_uchar,
                                                                outlen:
                                                                    *mut ::std::os::raw::c_ulong)
                                               -> ::std::os::raw::c_int>,
    /// Accelerated one shot F9
    /// @param key            The secret key
    /// @param keylen         The key length (octets)
    /// @param in             The message
    /// @param inlen          Length of message (octets)
    /// @param out            [out] Destination for tag
    /// @param outlen         [in/out] Initial and final size of out
    /// @return CRYPT_OK on success
    /// @remark Requires manual padding
    pub f9_memory: ::std::option::Option<unsafe extern "C" fn(key:
                                                                  *const ::std::os::raw::c_uchar,
                                                              keylen:
                                                                  ::std::os::raw::c_ulong,
                                                              in_:
                                                                  *const ::std::os::raw::c_uchar,
                                                              inlen:
                                                                  ::std::os::raw::c_ulong,
                                                              out:
                                                                  *mut ::std::os::raw::c_uchar,
                                                              outlen:
                                                                  *mut ::std::os::raw::c_ulong)
                                             -> ::std::os::raw::c_int>,
    /// Accelerated XTS encryption
    /// @param pt      Plaintext
    /// @param ct      Ciphertext
    /// @param blocks  The number of complete blocks to process
    /// @param tweak   The 128-bit encryption tweak (input/output).
    /// The tweak should not be encrypted on input, but
    /// next tweak will be copied encrypted on output.
    /// @param skey1   The first scheduled key context
    /// @param skey2   The second scheduled key context
    /// @return CRYPT_OK if successful
    pub accel_xts_encrypt: ::std::option::Option<unsafe extern "C" fn(pt:
                                                                          *const ::std::os::raw::c_uchar,
                                                                      ct:
                                                                          *mut ::std::os::raw::c_uchar,
                                                                      blocks:
                                                                          ::std::os::raw::c_ulong,
                                                                      tweak:
                                                                          *mut ::std::os::raw::c_uchar,
                                                                      skey1:
                                                                          *mut symmetric_key,
                                                                      skey2:
                                                                          *mut symmetric_key)
                                                     ->
                                                         ::std::os::raw::c_int>,
    /// Accelerated XTS decryption
    /// @param ct      Ciphertext
    /// @param pt      Plaintext
    /// @param blocks  The number of complete blocks to process
    /// @param tweak   The 128-bit encryption tweak (input/output).
    /// The tweak should not be encrypted on input, but
    /// next tweak will be copied encrypted on output.
    /// @param skey1   The first scheduled key context
    /// @param skey2   The second scheduled key context
    /// @return CRYPT_OK if successful
    pub accel_xts_decrypt: ::std::option::Option<unsafe extern "C" fn(ct:
                                                                          *const ::std::os::raw::c_uchar,
                                                                      pt:
                                                                          *mut ::std::os::raw::c_uchar,
                                                                      blocks:
                                                                          ::std::os::raw::c_ulong,
                                                                      tweak:
                                                                          *mut ::std::os::raw::c_uchar,
                                                                      skey1:
                                                                          *mut symmetric_key,
                                                                      skey2:
                                                                          *mut symmetric_key)
                                                     ->
                                                         ::std::os::raw::c_int>,
}
#[test]
fn bindgen_test_layout_ltc_cipher_descriptor() {
    assert_eq!(::std::mem::size_of::<ltc_cipher_descriptor>() , 192usize ,
               concat ! ( "Size of: " , stringify ! ( ltc_cipher_descriptor )
               ));
    assert_eq! (::std::mem::align_of::<ltc_cipher_descriptor>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( ltc_cipher_descriptor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) . name as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) . ID as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( ID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) .
                min_key_length as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( min_key_length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) .
                max_key_length as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( max_key_length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) . block_length
                as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( block_length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) .
                default_rounds as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( default_rounds ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) . setup as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( setup ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) . ecb_encrypt
                as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( ecb_encrypt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) . ecb_decrypt
                as * const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( ecb_decrypt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) . test as *
                const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( test ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) . done as *
                const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( done ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) . keysize as *
                const _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( keysize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) .
                accel_ecb_encrypt as * const _ as usize } , 80usize , concat !
                (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( accel_ecb_encrypt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) .
                accel_ecb_decrypt as * const _ as usize } , 88usize , concat !
                (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( accel_ecb_decrypt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) .
                accel_cbc_encrypt as * const _ as usize } , 96usize , concat !
                (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( accel_cbc_encrypt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) .
                accel_cbc_decrypt as * const _ as usize } , 104usize , concat
                ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( accel_cbc_decrypt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) .
                accel_ctr_encrypt as * const _ as usize } , 112usize , concat
                ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( accel_ctr_encrypt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) .
                accel_lrw_encrypt as * const _ as usize } , 120usize , concat
                ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( accel_lrw_encrypt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) .
                accel_lrw_decrypt as * const _ as usize } , 128usize , concat
                ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( accel_lrw_decrypt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) .
                accel_ccm_memory as * const _ as usize } , 136usize , concat !
                (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( accel_ccm_memory ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) .
                accel_gcm_memory as * const _ as usize } , 144usize , concat !
                (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( accel_gcm_memory ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) . omac_memory
                as * const _ as usize } , 152usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( omac_memory ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) . xcbc_memory
                as * const _ as usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( xcbc_memory ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) . f9_memory as
                * const _ as usize } , 168usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( f9_memory ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) .
                accel_xts_encrypt as * const _ as usize } , 176usize , concat
                ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( accel_xts_encrypt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_cipher_descriptor ) ) .
                accel_xts_decrypt as * const _ as usize } , 184usize , concat
                ! (
                "Alignment of field: " , stringify ! ( ltc_cipher_descriptor )
                , "::" , stringify ! ( accel_xts_decrypt ) ));
}
impl Clone for ltc_cipher_descriptor {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    #[link_name = "cipher_descriptor"]
    pub static mut cipher_descriptor: [ltc_cipher_descriptor; 0usize];
}
extern "C" {
    pub fn blowfish_setup(key: *const ::std::os::raw::c_uchar,
                          keylen: ::std::os::raw::c_int,
                          num_rounds: ::std::os::raw::c_int,
                          skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn blowfish_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                                ct: *mut ::std::os::raw::c_uchar,
                                skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn blowfish_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                                pt: *mut ::std::os::raw::c_uchar,
                                skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn blowfish_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn blowfish_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn blowfish_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "blowfish_desc"]
    pub static blowfish_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn rc5_setup(key: *const ::std::os::raw::c_uchar,
                     keylen: ::std::os::raw::c_int,
                     num_rounds: ::std::os::raw::c_int,
                     skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc5_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                           ct: *mut ::std::os::raw::c_uchar,
                           skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc5_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                           pt: *mut ::std::os::raw::c_uchar,
                           skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc5_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc5_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn rc5_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "rc5_desc"]
    pub static rc5_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn rc6_setup(key: *const ::std::os::raw::c_uchar,
                     keylen: ::std::os::raw::c_int,
                     num_rounds: ::std::os::raw::c_int,
                     skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc6_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                           ct: *mut ::std::os::raw::c_uchar,
                           skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc6_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                           pt: *mut ::std::os::raw::c_uchar,
                           skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc6_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc6_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn rc6_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "rc6_desc"]
    pub static rc6_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn rc2_setup(key: *const ::std::os::raw::c_uchar,
                     keylen: ::std::os::raw::c_int,
                     num_rounds: ::std::os::raw::c_int,
                     skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc2_setup_ex(key: *const ::std::os::raw::c_uchar,
                        keylen: ::std::os::raw::c_int,
                        bits: ::std::os::raw::c_int,
                        num_rounds: ::std::os::raw::c_int,
                        skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc2_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                           ct: *mut ::std::os::raw::c_uchar,
                           skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc2_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                           pt: *mut ::std::os::raw::c_uchar,
                           skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc2_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc2_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn rc2_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "rc2_desc"]
    pub static rc2_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn saferp_setup(key: *const ::std::os::raw::c_uchar,
                        keylen: ::std::os::raw::c_int,
                        num_rounds: ::std::os::raw::c_int,
                        skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn saferp_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                              ct: *mut ::std::os::raw::c_uchar,
                              skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn saferp_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                              pt: *mut ::std::os::raw::c_uchar,
                              skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn saferp_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn saferp_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn saferp_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "saferp_desc"]
    pub static saferp_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn safer_k64_setup(key: *const ::std::os::raw::c_uchar,
                           keylen: ::std::os::raw::c_int,
                           num_rounds: ::std::os::raw::c_int,
                           skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn safer_sk64_setup(key: *const ::std::os::raw::c_uchar,
                            keylen: ::std::os::raw::c_int,
                            num_rounds: ::std::os::raw::c_int,
                            skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn safer_k128_setup(key: *const ::std::os::raw::c_uchar,
                            keylen: ::std::os::raw::c_int,
                            num_rounds: ::std::os::raw::c_int,
                            skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn safer_sk128_setup(key: *const ::std::os::raw::c_uchar,
                             keylen: ::std::os::raw::c_int,
                             num_rounds: ::std::os::raw::c_int,
                             skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn safer_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                             ct: *mut ::std::os::raw::c_uchar,
                             key: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn safer_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                             pt: *mut ::std::os::raw::c_uchar,
                             key: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn safer_k64_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn safer_sk64_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn safer_sk128_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn safer_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn safer_64_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn safer_128_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "safer_k64_desc"]
    pub static safer_k64_desc: ltc_cipher_descriptor;
}
extern "C" {
    #[link_name = "safer_k128_desc"]
    pub static safer_k128_desc: ltc_cipher_descriptor;
}
extern "C" {
    #[link_name = "safer_sk64_desc"]
    pub static safer_sk64_desc: ltc_cipher_descriptor;
}
extern "C" {
    #[link_name = "safer_sk128_desc"]
    pub static safer_sk128_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn rijndael_setup(key: *const ::std::os::raw::c_uchar,
                          keylen: ::std::os::raw::c_int,
                          num_rounds: ::std::os::raw::c_int,
                          skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rijndael_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                                ct: *mut ::std::os::raw::c_uchar,
                                skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rijndael_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                                pt: *mut ::std::os::raw::c_uchar,
                                skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rijndael_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rijndael_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn rijndael_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rijndael_enc_setup(key: *const ::std::os::raw::c_uchar,
                              keylen: ::std::os::raw::c_int,
                              num_rounds: ::std::os::raw::c_int,
                              skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rijndael_enc_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                                    ct: *mut ::std::os::raw::c_uchar,
                                    skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rijndael_enc_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn rijndael_enc_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "rijndael_desc"]
    pub static rijndael_desc: ltc_cipher_descriptor;
}
extern "C" {
    #[link_name = "aes_desc"]
    pub static aes_desc: ltc_cipher_descriptor;
}
extern "C" {
    #[link_name = "rijndael_enc_desc"]
    pub static rijndael_enc_desc: ltc_cipher_descriptor;
}
extern "C" {
    #[link_name = "aes_enc_desc"]
    pub static aes_enc_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn xtea_setup(key: *const ::std::os::raw::c_uchar,
                      keylen: ::std::os::raw::c_int,
                      num_rounds: ::std::os::raw::c_int,
                      skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn xtea_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                            ct: *mut ::std::os::raw::c_uchar,
                            skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn xtea_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                            pt: *mut ::std::os::raw::c_uchar,
                            skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn xtea_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn xtea_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn xtea_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "xtea_desc"]
    pub static xtea_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn twofish_setup(key: *const ::std::os::raw::c_uchar,
                         keylen: ::std::os::raw::c_int,
                         num_rounds: ::std::os::raw::c_int,
                         skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn twofish_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                               ct: *mut ::std::os::raw::c_uchar,
                               skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn twofish_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                               pt: *mut ::std::os::raw::c_uchar,
                               skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn twofish_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn twofish_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn twofish_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "twofish_desc"]
    pub static twofish_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn des_setup(key: *const ::std::os::raw::c_uchar,
                     keylen: ::std::os::raw::c_int,
                     num_rounds: ::std::os::raw::c_int,
                     skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn des_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                           ct: *mut ::std::os::raw::c_uchar,
                           skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn des_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                           pt: *mut ::std::os::raw::c_uchar,
                           skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn des_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn des_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn des_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn des3_setup(key: *const ::std::os::raw::c_uchar,
                      keylen: ::std::os::raw::c_int,
                      num_rounds: ::std::os::raw::c_int,
                      skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn des3_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                            ct: *mut ::std::os::raw::c_uchar,
                            skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn des3_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                            pt: *mut ::std::os::raw::c_uchar,
                            skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn des3_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn des3_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn des3_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "des_desc"]
    pub static des_desc: ltc_cipher_descriptor;
}
extern "C" {
    #[link_name = "des3_desc"]
    pub static des3_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn cast5_setup(key: *const ::std::os::raw::c_uchar,
                       keylen: ::std::os::raw::c_int,
                       num_rounds: ::std::os::raw::c_int,
                       skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cast5_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                             ct: *mut ::std::os::raw::c_uchar,
                             skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cast5_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                             pt: *mut ::std::os::raw::c_uchar,
                             skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cast5_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cast5_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn cast5_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "cast5_desc"]
    pub static cast5_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn noekeon_setup(key: *const ::std::os::raw::c_uchar,
                         keylen: ::std::os::raw::c_int,
                         num_rounds: ::std::os::raw::c_int,
                         skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn noekeon_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                               ct: *mut ::std::os::raw::c_uchar,
                               skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn noekeon_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                               pt: *mut ::std::os::raw::c_uchar,
                               skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn noekeon_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn noekeon_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn noekeon_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "noekeon_desc"]
    pub static noekeon_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn skipjack_setup(key: *const ::std::os::raw::c_uchar,
                          keylen: ::std::os::raw::c_int,
                          num_rounds: ::std::os::raw::c_int,
                          skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn skipjack_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                                ct: *mut ::std::os::raw::c_uchar,
                                skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn skipjack_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                                pt: *mut ::std::os::raw::c_uchar,
                                skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn skipjack_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn skipjack_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn skipjack_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "skipjack_desc"]
    pub static skipjack_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn khazad_setup(key: *const ::std::os::raw::c_uchar,
                        keylen: ::std::os::raw::c_int,
                        num_rounds: ::std::os::raw::c_int,
                        skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn khazad_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                              ct: *mut ::std::os::raw::c_uchar,
                              skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn khazad_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                              pt: *mut ::std::os::raw::c_uchar,
                              skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn khazad_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn khazad_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn khazad_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "khazad_desc"]
    pub static khazad_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn anubis_setup(key: *const ::std::os::raw::c_uchar,
                        keylen: ::std::os::raw::c_int,
                        num_rounds: ::std::os::raw::c_int,
                        skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn anubis_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                              ct: *mut ::std::os::raw::c_uchar,
                              skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn anubis_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                              pt: *mut ::std::os::raw::c_uchar,
                              skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn anubis_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn anubis_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn anubis_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "anubis_desc"]
    pub static anubis_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn kseed_setup(key: *const ::std::os::raw::c_uchar,
                       keylen: ::std::os::raw::c_int,
                       num_rounds: ::std::os::raw::c_int,
                       skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kseed_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                             ct: *mut ::std::os::raw::c_uchar,
                             skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kseed_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                             pt: *mut ::std::os::raw::c_uchar,
                             skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kseed_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kseed_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn kseed_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "kseed_desc"]
    pub static kseed_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn kasumi_setup(key: *const ::std::os::raw::c_uchar,
                        keylen: ::std::os::raw::c_int,
                        num_rounds: ::std::os::raw::c_int,
                        skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kasumi_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                              ct: *mut ::std::os::raw::c_uchar,
                              skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kasumi_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                              pt: *mut ::std::os::raw::c_uchar,
                              skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kasumi_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kasumi_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn kasumi_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "kasumi_desc"]
    pub static kasumi_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn multi2_setup(key: *const ::std::os::raw::c_uchar,
                        keylen: ::std::os::raw::c_int,
                        num_rounds: ::std::os::raw::c_int,
                        skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn multi2_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                              ct: *mut ::std::os::raw::c_uchar,
                              skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn multi2_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                              pt: *mut ::std::os::raw::c_uchar,
                              skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn multi2_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn multi2_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn multi2_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "multi2_desc"]
    pub static multi2_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn camellia_setup(key: *const ::std::os::raw::c_uchar,
                          keylen: ::std::os::raw::c_int,
                          num_rounds: ::std::os::raw::c_int,
                          skey: *mut symmetric_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn camellia_ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                                ct: *mut ::std::os::raw::c_uchar,
                                skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn camellia_ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                                pt: *mut ::std::os::raw::c_uchar,
                                skey: *mut symmetric_key)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn camellia_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn camellia_done(skey: *mut symmetric_key);
}
extern "C" {
    pub fn camellia_keysize(keysize: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "camellia_desc"]
    pub static camellia_desc: ltc_cipher_descriptor;
}
extern "C" {
    pub fn ecb_start(cipher: ::std::os::raw::c_int,
                     key: *const ::std::os::raw::c_uchar,
                     keylen: ::std::os::raw::c_int,
                     num_rounds: ::std::os::raw::c_int,
                     ecb: *mut symmetric_ECB) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ecb_encrypt(pt: *const ::std::os::raw::c_uchar,
                       ct: *mut ::std::os::raw::c_uchar,
                       len: ::std::os::raw::c_ulong, ecb: *mut symmetric_ECB)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ecb_decrypt(ct: *const ::std::os::raw::c_uchar,
                       pt: *mut ::std::os::raw::c_uchar,
                       len: ::std::os::raw::c_ulong, ecb: *mut symmetric_ECB)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ecb_done(ecb: *mut symmetric_ECB) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cfb_start(cipher: ::std::os::raw::c_int,
                     IV: *const ::std::os::raw::c_uchar,
                     key: *const ::std::os::raw::c_uchar,
                     keylen: ::std::os::raw::c_int,
                     num_rounds: ::std::os::raw::c_int,
                     cfb: *mut symmetric_CFB) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cfb_encrypt(pt: *const ::std::os::raw::c_uchar,
                       ct: *mut ::std::os::raw::c_uchar,
                       len: ::std::os::raw::c_ulong, cfb: *mut symmetric_CFB)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cfb_decrypt(ct: *const ::std::os::raw::c_uchar,
                       pt: *mut ::std::os::raw::c_uchar,
                       len: ::std::os::raw::c_ulong, cfb: *mut symmetric_CFB)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cfb_getiv(IV: *mut ::std::os::raw::c_uchar,
                     len: *mut ::std::os::raw::c_ulong,
                     cfb: *mut symmetric_CFB) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cfb_setiv(IV: *const ::std::os::raw::c_uchar,
                     len: ::std::os::raw::c_ulong, cfb: *mut symmetric_CFB)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cfb_done(cfb: *mut symmetric_CFB) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ofb_start(cipher: ::std::os::raw::c_int,
                     IV: *const ::std::os::raw::c_uchar,
                     key: *const ::std::os::raw::c_uchar,
                     keylen: ::std::os::raw::c_int,
                     num_rounds: ::std::os::raw::c_int,
                     ofb: *mut symmetric_OFB) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ofb_encrypt(pt: *const ::std::os::raw::c_uchar,
                       ct: *mut ::std::os::raw::c_uchar,
                       len: ::std::os::raw::c_ulong, ofb: *mut symmetric_OFB)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ofb_decrypt(ct: *const ::std::os::raw::c_uchar,
                       pt: *mut ::std::os::raw::c_uchar,
                       len: ::std::os::raw::c_ulong, ofb: *mut symmetric_OFB)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ofb_getiv(IV: *mut ::std::os::raw::c_uchar,
                     len: *mut ::std::os::raw::c_ulong,
                     ofb: *mut symmetric_OFB) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ofb_setiv(IV: *const ::std::os::raw::c_uchar,
                     len: ::std::os::raw::c_ulong, ofb: *mut symmetric_OFB)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ofb_done(ofb: *mut symmetric_OFB) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cbc_start(cipher: ::std::os::raw::c_int,
                     IV: *const ::std::os::raw::c_uchar,
                     key: *const ::std::os::raw::c_uchar,
                     keylen: ::std::os::raw::c_int,
                     num_rounds: ::std::os::raw::c_int,
                     cbc: *mut symmetric_CBC) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cbc_encrypt(pt: *const ::std::os::raw::c_uchar,
                       ct: *mut ::std::os::raw::c_uchar,
                       len: ::std::os::raw::c_ulong, cbc: *mut symmetric_CBC)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cbc_decrypt(ct: *const ::std::os::raw::c_uchar,
                       pt: *mut ::std::os::raw::c_uchar,
                       len: ::std::os::raw::c_ulong, cbc: *mut symmetric_CBC)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cbc_getiv(IV: *mut ::std::os::raw::c_uchar,
                     len: *mut ::std::os::raw::c_ulong,
                     cbc: *mut symmetric_CBC) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cbc_setiv(IV: *const ::std::os::raw::c_uchar,
                     len: ::std::os::raw::c_ulong, cbc: *mut symmetric_CBC)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cbc_done(cbc: *mut symmetric_CBC) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctr_start(cipher: ::std::os::raw::c_int,
                     IV: *const ::std::os::raw::c_uchar,
                     key: *const ::std::os::raw::c_uchar,
                     keylen: ::std::os::raw::c_int,
                     num_rounds: ::std::os::raw::c_int,
                     ctr_mode: ::std::os::raw::c_int, ctr: *mut symmetric_CTR)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctr_encrypt(pt: *const ::std::os::raw::c_uchar,
                       ct: *mut ::std::os::raw::c_uchar,
                       len: ::std::os::raw::c_ulong, ctr: *mut symmetric_CTR)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctr_decrypt(ct: *const ::std::os::raw::c_uchar,
                       pt: *mut ::std::os::raw::c_uchar,
                       len: ::std::os::raw::c_ulong, ctr: *mut symmetric_CTR)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctr_getiv(IV: *mut ::std::os::raw::c_uchar,
                     len: *mut ::std::os::raw::c_ulong,
                     ctr: *mut symmetric_CTR) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctr_setiv(IV: *const ::std::os::raw::c_uchar,
                     len: ::std::os::raw::c_ulong, ctr: *mut symmetric_CTR)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctr_done(ctr: *mut symmetric_CTR) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctr_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrw_start(cipher: ::std::os::raw::c_int,
                     IV: *const ::std::os::raw::c_uchar,
                     key: *const ::std::os::raw::c_uchar,
                     keylen: ::std::os::raw::c_int,
                     tweak: *const ::std::os::raw::c_uchar,
                     num_rounds: ::std::os::raw::c_int,
                     lrw: *mut symmetric_LRW) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrw_encrypt(pt: *const ::std::os::raw::c_uchar,
                       ct: *mut ::std::os::raw::c_uchar,
                       len: ::std::os::raw::c_ulong, lrw: *mut symmetric_LRW)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrw_decrypt(ct: *const ::std::os::raw::c_uchar,
                       pt: *mut ::std::os::raw::c_uchar,
                       len: ::std::os::raw::c_ulong, lrw: *mut symmetric_LRW)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrw_getiv(IV: *mut ::std::os::raw::c_uchar,
                     len: *mut ::std::os::raw::c_ulong,
                     lrw: *mut symmetric_LRW) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrw_setiv(IV: *const ::std::os::raw::c_uchar,
                     len: ::std::os::raw::c_ulong, lrw: *mut symmetric_LRW)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrw_done(lrw: *mut symmetric_LRW) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrw_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrw_process(pt: *const ::std::os::raw::c_uchar,
                       ct: *mut ::std::os::raw::c_uchar,
                       len: ::std::os::raw::c_ulong,
                       mode: ::std::os::raw::c_int, lrw: *mut symmetric_LRW)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn f8_start(cipher: ::std::os::raw::c_int,
                    IV: *const ::std::os::raw::c_uchar,
                    key: *const ::std::os::raw::c_uchar,
                    keylen: ::std::os::raw::c_int,
                    salt_key: *const ::std::os::raw::c_uchar,
                    skeylen: ::std::os::raw::c_int,
                    num_rounds: ::std::os::raw::c_int, f8: *mut symmetric_F8)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn f8_encrypt(pt: *const ::std::os::raw::c_uchar,
                      ct: *mut ::std::os::raw::c_uchar,
                      len: ::std::os::raw::c_ulong, f8: *mut symmetric_F8)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn f8_decrypt(ct: *const ::std::os::raw::c_uchar,
                      pt: *mut ::std::os::raw::c_uchar,
                      len: ::std::os::raw::c_ulong, f8: *mut symmetric_F8)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn f8_getiv(IV: *mut ::std::os::raw::c_uchar,
                    len: *mut ::std::os::raw::c_ulong, f8: *mut symmetric_F8)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn f8_setiv(IV: *const ::std::os::raw::c_uchar,
                    len: ::std::os::raw::c_ulong, f8: *mut symmetric_F8)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn f8_done(f8: *mut symmetric_F8) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn f8_test_mode() -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy)]
pub struct symmetric_xts {
    pub key1: symmetric_key,
    pub key2: symmetric_key,
    pub cipher: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_symmetric_xts() {
    assert_eq!(::std::mem::size_of::<symmetric_xts>() , 8520usize , concat ! (
               "Size of: " , stringify ! ( symmetric_xts ) ));
    assert_eq! (::std::mem::align_of::<symmetric_xts>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( symmetric_xts ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_xts ) ) . key1 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_xts ) , "::"
                , stringify ! ( key1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_xts ) ) . key2 as * const _ as
                usize } , 4256usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_xts ) , "::"
                , stringify ! ( key2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const symmetric_xts ) ) . cipher as * const _
                as usize } , 8512usize , concat ! (
                "Alignment of field: " , stringify ! ( symmetric_xts ) , "::"
                , stringify ! ( cipher ) ));
}
impl Clone for symmetric_xts {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn xts_start(cipher: ::std::os::raw::c_int,
                     key1: *const ::std::os::raw::c_uchar,
                     key2: *const ::std::os::raw::c_uchar,
                     keylen: ::std::os::raw::c_ulong,
                     num_rounds: ::std::os::raw::c_int,
                     xts: *mut symmetric_xts) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn xts_encrypt(pt: *const ::std::os::raw::c_uchar,
                       ptlen: ::std::os::raw::c_ulong,
                       ct: *mut ::std::os::raw::c_uchar,
                       tweak: *mut ::std::os::raw::c_uchar,
                       xts: *mut symmetric_xts) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn xts_decrypt(ct: *const ::std::os::raw::c_uchar,
                       ptlen: ::std::os::raw::c_ulong,
                       pt: *mut ::std::os::raw::c_uchar,
                       tweak: *mut ::std::os::raw::c_uchar,
                       xts: *mut symmetric_xts) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn xts_done(xts: *mut symmetric_xts);
}
extern "C" {
    pub fn xts_test() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn xts_mult_x(I: *mut ::std::os::raw::c_uchar);
}
extern "C" {
    pub fn find_cipher(name: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn find_cipher_any(name: *const ::std::os::raw::c_char,
                           blocklen: ::std::os::raw::c_int,
                           keylen: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn find_cipher_id(ID: ::std::os::raw::c_uchar)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn register_cipher(cipher: *const ltc_cipher_descriptor)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unregister_cipher(cipher: *const ltc_cipher_descriptor)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn register_all_ciphers() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cipher_is_valid(idx: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy)]
pub struct chacha_state {
    pub input: [ulong32; 16usize],
    pub kstream: [::std::os::raw::c_uchar; 64usize],
    pub ksleft: ::std::os::raw::c_ulong,
    pub ivlen: ::std::os::raw::c_ulong,
    pub rounds: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_chacha_state() {
    assert_eq!(::std::mem::size_of::<chacha_state>() , 152usize , concat ! (
               "Size of: " , stringify ! ( chacha_state ) ));
    assert_eq! (::std::mem::align_of::<chacha_state>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( chacha_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const chacha_state ) ) . input as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( chacha_state ) , "::" ,
                stringify ! ( input ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const chacha_state ) ) . kstream as * const _
                as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( chacha_state ) , "::" ,
                stringify ! ( kstream ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const chacha_state ) ) . ksleft as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( chacha_state ) , "::" ,
                stringify ! ( ksleft ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const chacha_state ) ) . ivlen as * const _ as
                usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( chacha_state ) , "::" ,
                stringify ! ( ivlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const chacha_state ) ) . rounds as * const _ as
                usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( chacha_state ) , "::" ,
                stringify ! ( rounds ) ));
}
impl Clone for chacha_state {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn chacha_setup(st: *mut chacha_state,
                        key: *const ::std::os::raw::c_uchar,
                        keylen: ::std::os::raw::c_ulong,
                        rounds: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chacha_ivctr32(st: *mut chacha_state,
                          iv: *const ::std::os::raw::c_uchar,
                          ivlen: ::std::os::raw::c_ulong, counter: ulong32)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chacha_ivctr64(st: *mut chacha_state,
                          iv: *const ::std::os::raw::c_uchar,
                          ivlen: ::std::os::raw::c_ulong, counter: ulong64)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chacha_crypt(st: *mut chacha_state,
                        in_: *const ::std::os::raw::c_uchar,
                        inlen: ::std::os::raw::c_ulong,
                        out: *mut ::std::os::raw::c_uchar)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chacha_keystream(st: *mut chacha_state,
                            out: *mut ::std::os::raw::c_uchar,
                            outlen: ::std::os::raw::c_ulong)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chacha_done(st: *mut chacha_state) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chacha_test() -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy)]
pub struct rc4_state {
    pub x: ::std::os::raw::c_uint,
    pub y: ::std::os::raw::c_uint,
    pub buf: [::std::os::raw::c_uchar; 256usize],
}
#[test]
fn bindgen_test_layout_rc4_state() {
    assert_eq!(::std::mem::size_of::<rc4_state>() , 264usize , concat ! (
               "Size of: " , stringify ! ( rc4_state ) ));
    assert_eq! (::std::mem::align_of::<rc4_state>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( rc4_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rc4_state ) ) . x as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rc4_state ) , "::" ,
                stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rc4_state ) ) . y as * const _ as usize }
                , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( rc4_state ) , "::" ,
                stringify ! ( y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rc4_state ) ) . buf as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rc4_state ) , "::" ,
                stringify ! ( buf ) ));
}
impl Clone for rc4_state {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn rc4_stream_setup(st: *mut rc4_state,
                            key: *const ::std::os::raw::c_uchar,
                            keylen: ::std::os::raw::c_ulong)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc4_stream_crypt(st: *mut rc4_state,
                            in_: *const ::std::os::raw::c_uchar,
                            inlen: ::std::os::raw::c_ulong,
                            out: *mut ::std::os::raw::c_uchar)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc4_stream_keystream(st: *mut rc4_state,
                                out: *mut ::std::os::raw::c_uchar,
                                outlen: ::std::os::raw::c_ulong)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc4_stream_done(st: *mut rc4_state) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc4_stream_test() -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct sober128_state {
    pub R: [ulong32; 17usize],
    pub initR: [ulong32; 17usize],
    pub konst: ulong32,
    pub sbuf: ulong32,
    pub nbuf: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_sober128_state() {
    assert_eq!(::std::mem::size_of::<sober128_state>() , 148usize , concat ! (
               "Size of: " , stringify ! ( sober128_state ) ));
    assert_eq! (::std::mem::align_of::<sober128_state>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( sober128_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sober128_state ) ) . R as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sober128_state ) , "::"
                , stringify ! ( R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sober128_state ) ) . initR as * const _
                as usize } , 68usize , concat ! (
                "Alignment of field: " , stringify ! ( sober128_state ) , "::"
                , stringify ! ( initR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sober128_state ) ) . konst as * const _
                as usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( sober128_state ) , "::"
                , stringify ! ( konst ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sober128_state ) ) . sbuf as * const _ as
                usize } , 140usize , concat ! (
                "Alignment of field: " , stringify ! ( sober128_state ) , "::"
                , stringify ! ( sbuf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sober128_state ) ) . nbuf as * const _ as
                usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( sober128_state ) , "::"
                , stringify ! ( nbuf ) ));
}
impl Clone for sober128_state {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn sober128_stream_setup(st: *mut sober128_state,
                                 key: *const ::std::os::raw::c_uchar,
                                 keylen: ::std::os::raw::c_ulong)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sober128_stream_setiv(st: *mut sober128_state,
                                 iv: *const ::std::os::raw::c_uchar,
                                 ivlen: ::std::os::raw::c_ulong)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sober128_stream_crypt(st: *mut sober128_state,
                                 in_: *const ::std::os::raw::c_uchar,
                                 inlen: ::std::os::raw::c_ulong,
                                 out: *mut ::std::os::raw::c_uchar)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sober128_stream_keystream(st: *mut sober128_state,
                                     out: *mut ::std::os::raw::c_uchar,
                                     outlen: ::std::os::raw::c_ulong)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sober128_stream_done(st: *mut sober128_state)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sober128_stream_test() -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy)]
pub struct sha3_state {
    pub saved: ulong64,
    pub s: [ulong64; 25usize],
    pub sb: [::std::os::raw::c_uchar; 200usize],
    pub byte_index: ::std::os::raw::c_ushort,
    pub word_index: ::std::os::raw::c_ushort,
    pub capacity_words: ::std::os::raw::c_ushort,
    pub xof_flag: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_sha3_state() {
    assert_eq!(::std::mem::size_of::<sha3_state>() , 416usize , concat ! (
               "Size of: " , stringify ! ( sha3_state ) ));
    assert_eq! (::std::mem::align_of::<sha3_state>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( sha3_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha3_state ) ) . saved as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sha3_state ) , "::" ,
                stringify ! ( saved ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha3_state ) ) . s as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( sha3_state ) , "::" ,
                stringify ! ( s ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha3_state ) ) . sb as * const _ as usize
                } , 208usize , concat ! (
                "Alignment of field: " , stringify ! ( sha3_state ) , "::" ,
                stringify ! ( sb ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha3_state ) ) . byte_index as * const _
                as usize } , 408usize , concat ! (
                "Alignment of field: " , stringify ! ( sha3_state ) , "::" ,
                stringify ! ( byte_index ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha3_state ) ) . word_index as * const _
                as usize } , 410usize , concat ! (
                "Alignment of field: " , stringify ! ( sha3_state ) , "::" ,
                stringify ! ( word_index ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha3_state ) ) . capacity_words as *
                const _ as usize } , 412usize , concat ! (
                "Alignment of field: " , stringify ! ( sha3_state ) , "::" ,
                stringify ! ( capacity_words ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha3_state ) ) . xof_flag as * const _ as
                usize } , 414usize , concat ! (
                "Alignment of field: " , stringify ! ( sha3_state ) , "::" ,
                stringify ! ( xof_flag ) ));
}
impl Clone for sha3_state {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct sha512_state {
    pub length: ulong64,
    pub state: [ulong64; 8usize],
    pub curlen: ::std::os::raw::c_ulong,
    pub buf: [::std::os::raw::c_uchar; 128usize],
}
#[test]
fn bindgen_test_layout_sha512_state() {
    assert_eq!(::std::mem::size_of::<sha512_state>() , 208usize , concat ! (
               "Size of: " , stringify ! ( sha512_state ) ));
    assert_eq! (::std::mem::align_of::<sha512_state>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( sha512_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha512_state ) ) . length as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sha512_state ) , "::" ,
                stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha512_state ) ) . state as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( sha512_state ) , "::" ,
                stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha512_state ) ) . curlen as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( sha512_state ) , "::" ,
                stringify ! ( curlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha512_state ) ) . buf as * const _ as
                usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( sha512_state ) , "::" ,
                stringify ! ( buf ) ));
}
impl Clone for sha512_state {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct sha256_state {
    pub length: ulong64,
    pub state: [ulong32; 8usize],
    pub curlen: ulong32,
    pub buf: [::std::os::raw::c_uchar; 64usize],
}
#[test]
fn bindgen_test_layout_sha256_state() {
    assert_eq!(::std::mem::size_of::<sha256_state>() , 112usize , concat ! (
               "Size of: " , stringify ! ( sha256_state ) ));
    assert_eq! (::std::mem::align_of::<sha256_state>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( sha256_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha256_state ) ) . length as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sha256_state ) , "::" ,
                stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha256_state ) ) . state as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( sha256_state ) , "::" ,
                stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha256_state ) ) . curlen as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( sha256_state ) , "::" ,
                stringify ! ( curlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha256_state ) ) . buf as * const _ as
                usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( sha256_state ) , "::" ,
                stringify ! ( buf ) ));
}
impl Clone for sha256_state {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct sha1_state {
    pub length: ulong64,
    pub state: [ulong32; 5usize],
    pub curlen: ulong32,
    pub buf: [::std::os::raw::c_uchar; 64usize],
}
#[test]
fn bindgen_test_layout_sha1_state() {
    assert_eq!(::std::mem::size_of::<sha1_state>() , 96usize , concat ! (
               "Size of: " , stringify ! ( sha1_state ) ));
    assert_eq! (::std::mem::align_of::<sha1_state>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( sha1_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha1_state ) ) . length as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sha1_state ) , "::" ,
                stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha1_state ) ) . state as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( sha1_state ) , "::" ,
                stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha1_state ) ) . curlen as * const _ as
                usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( sha1_state ) , "::" ,
                stringify ! ( curlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sha1_state ) ) . buf as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( sha1_state ) , "::" ,
                stringify ! ( buf ) ));
}
impl Clone for sha1_state {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct md5_state {
    pub length: ulong64,
    pub state: [ulong32; 4usize],
    pub curlen: ulong32,
    pub buf: [::std::os::raw::c_uchar; 64usize],
}
#[test]
fn bindgen_test_layout_md5_state() {
    assert_eq!(::std::mem::size_of::<md5_state>() , 96usize , concat ! (
               "Size of: " , stringify ! ( md5_state ) ));
    assert_eq! (::std::mem::align_of::<md5_state>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( md5_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const md5_state ) ) . length as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( md5_state ) , "::" ,
                stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const md5_state ) ) . state as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( md5_state ) , "::" ,
                stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const md5_state ) ) . curlen as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( md5_state ) , "::" ,
                stringify ! ( curlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const md5_state ) ) . buf as * const _ as usize
                } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( md5_state ) , "::" ,
                stringify ! ( buf ) ));
}
impl Clone for md5_state {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct md4_state {
    pub length: ulong64,
    pub state: [ulong32; 4usize],
    pub curlen: ulong32,
    pub buf: [::std::os::raw::c_uchar; 64usize],
}
#[test]
fn bindgen_test_layout_md4_state() {
    assert_eq!(::std::mem::size_of::<md4_state>() , 96usize , concat ! (
               "Size of: " , stringify ! ( md4_state ) ));
    assert_eq! (::std::mem::align_of::<md4_state>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( md4_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const md4_state ) ) . length as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( md4_state ) , "::" ,
                stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const md4_state ) ) . state as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( md4_state ) , "::" ,
                stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const md4_state ) ) . curlen as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( md4_state ) , "::" ,
                stringify ! ( curlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const md4_state ) ) . buf as * const _ as usize
                } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( md4_state ) , "::" ,
                stringify ! ( buf ) ));
}
impl Clone for md4_state {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct tiger_state {
    pub state: [ulong64; 3usize],
    pub length: ulong64,
    pub curlen: ::std::os::raw::c_ulong,
    pub buf: [::std::os::raw::c_uchar; 64usize],
}
#[test]
fn bindgen_test_layout_tiger_state() {
    assert_eq!(::std::mem::size_of::<tiger_state>() , 104usize , concat ! (
               "Size of: " , stringify ! ( tiger_state ) ));
    assert_eq! (::std::mem::align_of::<tiger_state>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( tiger_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tiger_state ) ) . state as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( tiger_state ) , "::" ,
                stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tiger_state ) ) . length as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( tiger_state ) , "::" ,
                stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tiger_state ) ) . curlen as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( tiger_state ) , "::" ,
                stringify ! ( curlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tiger_state ) ) . buf as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( tiger_state ) , "::" ,
                stringify ! ( buf ) ));
}
impl Clone for tiger_state {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct md2_state {
    pub chksum: [::std::os::raw::c_uchar; 16usize],
    pub X: [::std::os::raw::c_uchar; 48usize],
    pub buf: [::std::os::raw::c_uchar; 16usize],
    pub curlen: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_md2_state() {
    assert_eq!(::std::mem::size_of::<md2_state>() , 88usize , concat ! (
               "Size of: " , stringify ! ( md2_state ) ));
    assert_eq! (::std::mem::align_of::<md2_state>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( md2_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const md2_state ) ) . chksum as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( md2_state ) , "::" ,
                stringify ! ( chksum ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const md2_state ) ) . X as * const _ as usize }
                , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( md2_state ) , "::" ,
                stringify ! ( X ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const md2_state ) ) . buf as * const _ as usize
                } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( md2_state ) , "::" ,
                stringify ! ( buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const md2_state ) ) . curlen as * const _ as
                usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( md2_state ) , "::" ,
                stringify ! ( curlen ) ));
}
impl Clone for md2_state {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct rmd128_state {
    pub length: ulong64,
    pub buf: [::std::os::raw::c_uchar; 64usize],
    pub curlen: ulong32,
    pub state: [ulong32; 4usize],
}
#[test]
fn bindgen_test_layout_rmd128_state() {
    assert_eq!(::std::mem::size_of::<rmd128_state>() , 96usize , concat ! (
               "Size of: " , stringify ! ( rmd128_state ) ));
    assert_eq! (::std::mem::align_of::<rmd128_state>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rmd128_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmd128_state ) ) . length as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rmd128_state ) , "::" ,
                stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmd128_state ) ) . buf as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rmd128_state ) , "::" ,
                stringify ! ( buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmd128_state ) ) . curlen as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( rmd128_state ) , "::" ,
                stringify ! ( curlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmd128_state ) ) . state as * const _ as
                usize } , 76usize , concat ! (
                "Alignment of field: " , stringify ! ( rmd128_state ) , "::" ,
                stringify ! ( state ) ));
}
impl Clone for rmd128_state {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct rmd160_state {
    pub length: ulong64,
    pub buf: [::std::os::raw::c_uchar; 64usize],
    pub curlen: ulong32,
    pub state: [ulong32; 5usize],
}
#[test]
fn bindgen_test_layout_rmd160_state() {
    assert_eq!(::std::mem::size_of::<rmd160_state>() , 96usize , concat ! (
               "Size of: " , stringify ! ( rmd160_state ) ));
    assert_eq! (::std::mem::align_of::<rmd160_state>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rmd160_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmd160_state ) ) . length as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rmd160_state ) , "::" ,
                stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmd160_state ) ) . buf as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rmd160_state ) , "::" ,
                stringify ! ( buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmd160_state ) ) . curlen as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( rmd160_state ) , "::" ,
                stringify ! ( curlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmd160_state ) ) . state as * const _ as
                usize } , 76usize , concat ! (
                "Alignment of field: " , stringify ! ( rmd160_state ) , "::" ,
                stringify ! ( state ) ));
}
impl Clone for rmd160_state {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct rmd256_state {
    pub length: ulong64,
    pub buf: [::std::os::raw::c_uchar; 64usize],
    pub curlen: ulong32,
    pub state: [ulong32; 8usize],
}
#[test]
fn bindgen_test_layout_rmd256_state() {
    assert_eq!(::std::mem::size_of::<rmd256_state>() , 112usize , concat ! (
               "Size of: " , stringify ! ( rmd256_state ) ));
    assert_eq! (::std::mem::align_of::<rmd256_state>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rmd256_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmd256_state ) ) . length as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rmd256_state ) , "::" ,
                stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmd256_state ) ) . buf as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rmd256_state ) , "::" ,
                stringify ! ( buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmd256_state ) ) . curlen as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( rmd256_state ) , "::" ,
                stringify ! ( curlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmd256_state ) ) . state as * const _ as
                usize } , 76usize , concat ! (
                "Alignment of field: " , stringify ! ( rmd256_state ) , "::" ,
                stringify ! ( state ) ));
}
impl Clone for rmd256_state {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct rmd320_state {
    pub length: ulong64,
    pub buf: [::std::os::raw::c_uchar; 64usize],
    pub curlen: ulong32,
    pub state: [ulong32; 10usize],
}
#[test]
fn bindgen_test_layout_rmd320_state() {
    assert_eq!(::std::mem::size_of::<rmd320_state>() , 120usize , concat ! (
               "Size of: " , stringify ! ( rmd320_state ) ));
    assert_eq! (::std::mem::align_of::<rmd320_state>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rmd320_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmd320_state ) ) . length as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rmd320_state ) , "::" ,
                stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmd320_state ) ) . buf as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rmd320_state ) , "::" ,
                stringify ! ( buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmd320_state ) ) . curlen as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( rmd320_state ) , "::" ,
                stringify ! ( curlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmd320_state ) ) . state as * const _ as
                usize } , 76usize , concat ! (
                "Alignment of field: " , stringify ! ( rmd320_state ) , "::" ,
                stringify ! ( state ) ));
}
impl Clone for rmd320_state {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct whirlpool_state {
    pub length: ulong64,
    pub state: [ulong64; 8usize],
    pub buf: [::std::os::raw::c_uchar; 64usize],
    pub curlen: ulong32,
}
#[test]
fn bindgen_test_layout_whirlpool_state() {
    assert_eq!(::std::mem::size_of::<whirlpool_state>() , 144usize , concat !
               ( "Size of: " , stringify ! ( whirlpool_state ) ));
    assert_eq! (::std::mem::align_of::<whirlpool_state>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( whirlpool_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const whirlpool_state ) ) . length as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( whirlpool_state ) ,
                "::" , stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const whirlpool_state ) ) . state as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( whirlpool_state ) ,
                "::" , stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const whirlpool_state ) ) . buf as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( whirlpool_state ) ,
                "::" , stringify ! ( buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const whirlpool_state ) ) . curlen as * const _
                as usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( whirlpool_state ) ,
                "::" , stringify ! ( curlen ) ));
}
impl Clone for whirlpool_state {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct chc_state {
    pub length: ulong64,
    pub state: [::std::os::raw::c_uchar; 128usize],
    pub buf: [::std::os::raw::c_uchar; 128usize],
    pub curlen: ulong32,
}
#[test]
fn bindgen_test_layout_chc_state() {
    assert_eq!(::std::mem::size_of::<chc_state>() , 272usize , concat ! (
               "Size of: " , stringify ! ( chc_state ) ));
    assert_eq! (::std::mem::align_of::<chc_state>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( chc_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const chc_state ) ) . length as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( chc_state ) , "::" ,
                stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const chc_state ) ) . state as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( chc_state ) , "::" ,
                stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const chc_state ) ) . buf as * const _ as usize
                } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( chc_state ) , "::" ,
                stringify ! ( buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const chc_state ) ) . curlen as * const _ as
                usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( chc_state ) , "::" ,
                stringify ! ( curlen ) ));
}
impl Clone for chc_state {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct blake2s_state {
    pub h: [ulong32; 8usize],
    pub t: [ulong32; 2usize],
    pub f: [ulong32; 2usize],
    pub buf: [::std::os::raw::c_uchar; 64usize],
    pub curlen: ::std::os::raw::c_ulong,
    pub outlen: ::std::os::raw::c_ulong,
    pub last_node: ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_blake2s_state() {
    assert_eq!(::std::mem::size_of::<blake2s_state>() , 136usize , concat ! (
               "Size of: " , stringify ! ( blake2s_state ) ));
    assert_eq! (::std::mem::align_of::<blake2s_state>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( blake2s_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const blake2s_state ) ) . h as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( blake2s_state ) , "::"
                , stringify ! ( h ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const blake2s_state ) ) . t as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( blake2s_state ) , "::"
                , stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const blake2s_state ) ) . f as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( blake2s_state ) , "::"
                , stringify ! ( f ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const blake2s_state ) ) . buf as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( blake2s_state ) , "::"
                , stringify ! ( buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const blake2s_state ) ) . curlen as * const _
                as usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( blake2s_state ) , "::"
                , stringify ! ( curlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const blake2s_state ) ) . outlen as * const _
                as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( blake2s_state ) , "::"
                , stringify ! ( outlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const blake2s_state ) ) . last_node as * const
                _ as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( blake2s_state ) , "::"
                , stringify ! ( last_node ) ));
}
impl Clone for blake2s_state {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct blake2b_state {
    pub h: [ulong64; 8usize],
    pub t: [ulong64; 2usize],
    pub f: [ulong64; 2usize],
    pub buf: [::std::os::raw::c_uchar; 128usize],
    pub curlen: ::std::os::raw::c_ulong,
    pub outlen: ::std::os::raw::c_ulong,
    pub last_node: ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_blake2b_state() {
    assert_eq!(::std::mem::size_of::<blake2b_state>() , 248usize , concat ! (
               "Size of: " , stringify ! ( blake2b_state ) ));
    assert_eq! (::std::mem::align_of::<blake2b_state>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( blake2b_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const blake2b_state ) ) . h as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( blake2b_state ) , "::"
                , stringify ! ( h ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const blake2b_state ) ) . t as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( blake2b_state ) , "::"
                , stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const blake2b_state ) ) . f as * const _ as
                usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( blake2b_state ) , "::"
                , stringify ! ( f ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const blake2b_state ) ) . buf as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( blake2b_state ) , "::"
                , stringify ! ( buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const blake2b_state ) ) . curlen as * const _
                as usize } , 224usize , concat ! (
                "Alignment of field: " , stringify ! ( blake2b_state ) , "::"
                , stringify ! ( curlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const blake2b_state ) ) . outlen as * const _
                as usize } , 232usize , concat ! (
                "Alignment of field: " , stringify ! ( blake2b_state ) , "::"
                , stringify ! ( outlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const blake2b_state ) ) . last_node as * const
                _ as usize } , 240usize , concat ! (
                "Alignment of field: " , stringify ! ( blake2b_state ) , "::"
                , stringify ! ( last_node ) ));
}
impl Clone for blake2b_state {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union Hash_state {
    pub dummy: [::std::os::raw::c_char; 1usize],
    pub chc: chc_state,
    pub whirlpool: whirlpool_state,
    pub sha3: sha3_state,
    pub sha512: sha512_state,
    pub sha256: sha256_state,
    pub sha1: sha1_state,
    pub md5: md5_state,
    pub md4: md4_state,
    pub md2: md2_state,
    pub tiger: tiger_state,
    pub rmd128: rmd128_state,
    pub rmd160: rmd160_state,
    pub rmd256: rmd256_state,
    pub rmd320: rmd320_state,
    pub blake2s: blake2s_state,
    pub blake2b: blake2b_state,
    pub data: *mut ::std::os::raw::c_void,
    _bindgen_union_align: [u64; 52usize],
}
#[test]
fn bindgen_test_layout_Hash_state() {
    assert_eq!(::std::mem::size_of::<Hash_state>() , 416usize , concat ! (
               "Size of: " , stringify ! ( Hash_state ) ));
    assert_eq! (::std::mem::align_of::<Hash_state>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Hash_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . dummy as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( dummy ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . chc as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( chc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . whirlpool as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( whirlpool ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . sha3 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( sha3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . sha512 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( sha512 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . sha256 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( sha256 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . sha1 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( sha1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . md5 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( md5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . md4 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( md4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . md2 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( md2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . tiger as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( tiger ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . rmd128 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( rmd128 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . rmd160 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( rmd160 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . rmd256 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( rmd256 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . rmd320 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( rmd320 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . blake2s as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( blake2s ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . blake2b as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( blake2b ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Hash_state ) ) . data as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Hash_state ) , "::" ,
                stringify ! ( data ) ));
}
impl Clone for Hash_state {
    fn clone(&self) -> Self { *self }
}
pub type hash_state = Hash_state;
/// hash descriptor
#[repr(C)]
#[derive(Debug, Copy)]
pub struct ltc_hash_descriptor {
    /// name of hash
    pub name: *const ::std::os::raw::c_char,
    /// internal ID
    pub ID: ::std::os::raw::c_uchar,
    /// Size of digest in octets
    pub hashsize: ::std::os::raw::c_ulong,
    /// Input block size in octets
    pub blocksize: ::std::os::raw::c_ulong,
    /// ASN.1 OID
    pub OID: [::std::os::raw::c_ulong; 16usize],
    /// Length of DER encoding
    pub OIDlen: ::std::os::raw::c_ulong,
    /// Init a hash state
    /// @param hash   The hash to initialize
    /// @return CRYPT_OK if successful
    pub init: ::std::option::Option<unsafe extern "C" fn(hash:
                                                             *mut hash_state)
                                        -> ::std::os::raw::c_int>,
    /// Process a block of data
    /// @param hash   The hash state
    /// @param in     The data to hash
    /// @param inlen  The length of the data (octets)
    /// @return CRYPT_OK if successful
    pub process: ::std::option::Option<unsafe extern "C" fn(hash:
                                                                *mut hash_state,
                                                            in_:
                                                                *const ::std::os::raw::c_uchar,
                                                            inlen:
                                                                ::std::os::raw::c_ulong)
                                           -> ::std::os::raw::c_int>,
    /// Produce the digest and store it
    /// @param hash   The hash state
    /// @param out    [out] The destination of the digest
    /// @return CRYPT_OK if successful
    pub done: ::std::option::Option<unsafe extern "C" fn(hash:
                                                             *mut hash_state,
                                                         out:
                                                             *mut ::std::os::raw::c_uchar)
                                        -> ::std::os::raw::c_int>,
    /// Self-test
    /// @return CRYPT_OK if successful, CRYPT_NOP if self-tests have been disabled
    pub test: ::std::option::Option<unsafe extern "C" fn()
                                        -> ::std::os::raw::c_int>,
    pub hmac_block: ::std::option::Option<unsafe extern "C" fn(key:
                                                                   *const ::std::os::raw::c_uchar,
                                                               keylen:
                                                                   ::std::os::raw::c_ulong,
                                                               in_:
                                                                   *const ::std::os::raw::c_uchar,
                                                               inlen:
                                                                   ::std::os::raw::c_ulong,
                                                               out:
                                                                   *mut ::std::os::raw::c_uchar,
                                                               outlen:
                                                                   *mut ::std::os::raw::c_ulong)
                                              -> ::std::os::raw::c_int>,
}
#[test]
fn bindgen_test_layout_ltc_hash_descriptor() {
    assert_eq!(::std::mem::size_of::<ltc_hash_descriptor>() , 208usize ,
               concat ! ( "Size of: " , stringify ! ( ltc_hash_descriptor )
               ));
    assert_eq! (::std::mem::align_of::<ltc_hash_descriptor>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( ltc_hash_descriptor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_hash_descriptor ) ) . name as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_hash_descriptor ) ,
                "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_hash_descriptor ) ) . ID as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_hash_descriptor ) ,
                "::" , stringify ! ( ID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_hash_descriptor ) ) . hashsize as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_hash_descriptor ) ,
                "::" , stringify ! ( hashsize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_hash_descriptor ) ) . blocksize as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_hash_descriptor ) ,
                "::" , stringify ! ( blocksize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_hash_descriptor ) ) . OID as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_hash_descriptor ) ,
                "::" , stringify ! ( OID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_hash_descriptor ) ) . OIDlen as *
                const _ as usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_hash_descriptor ) ,
                "::" , stringify ! ( OIDlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_hash_descriptor ) ) . init as * const
                _ as usize } , 168usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_hash_descriptor ) ,
                "::" , stringify ! ( init ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_hash_descriptor ) ) . process as *
                const _ as usize } , 176usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_hash_descriptor ) ,
                "::" , stringify ! ( process ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_hash_descriptor ) ) . done as * const
                _ as usize } , 184usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_hash_descriptor ) ,
                "::" , stringify ! ( done ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_hash_descriptor ) ) . test as * const
                _ as usize } , 192usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_hash_descriptor ) ,
                "::" , stringify ! ( test ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ltc_hash_descriptor ) ) . hmac_block as *
                const _ as usize } , 200usize , concat ! (
                "Alignment of field: " , stringify ! ( ltc_hash_descriptor ) ,
                "::" , stringify ! ( hmac_block ) ));
}
impl Clone for ltc_hash_descriptor {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    #[link_name = "hash_descriptor"]
    pub static mut hash_descriptor: [ltc_hash_descriptor; 0usize];
}
extern "C" {
    pub fn chc_register(cipher: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chc_init(md: *mut hash_state) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chc_process(md: *mut hash_state,
                       in_: *const ::std::os::raw::c_uchar,
                       inlen: ::std::os::raw::c_ulong)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chc_done(md: *mut hash_state, hash: *mut ::std::os::raw::c_uchar)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chc_test() -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "chc_desc"]
    pub static chc_desc: ltc_hash_descriptor;
}
extern "C" {
    pub fn whirlpool_init(md: *mut hash_state) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn whirlpool_process(md: *mut hash_state,
                             in_: *const ::std::os::raw::c_uchar,
                             inlen: ::std::os::raw::c_ulong)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn whirlpool_done(md: *mut hash_state,
                          hash: *mut ::std::os::raw::c_uchar)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn whirlpool_test() -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "whirlpool_desc"]
    pub static whirlpool_desc: ltc_hash_descriptor;
}
extern "C" {
    pub fn sha3_512_init(md: *mut hash_state) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sha3_512_test() -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "sha3_512_desc"]
    pub static sha3_512_desc: ltc_hash_descriptor;
}
extern "C" {
    pub fn sha3_384_init(md: *mut hash_state) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sha3_384_test() -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "sha3_384_desc"]
